{"stories":[{"type":"story","feature":"false","format":"video","location":"Brooklyn, NY","videourl":"https://www.youtube.com/watch?v=-fhZb14qvLI","videoid":"ZF1cfyaAk0g","title":"“We Gotta Do Both” Balancing School, Farm Work in Coachella Valley","author":"Olivia Rodriguez and Bryan Mendez","org":"Coachella Unincorporated","date":"11/02/20","featureImage":"articles/Parole_2020_site.jpg","featureImageSmall":"articles/Parole_2020_site_small.jpg","summary":"The pandemic has forced many young adults to pick up a job while juggling online college classes. What that looks like for Eduardo Jaime: working part-time in the fields while navigating his third year at Cal State San Bernardino.","text":"<p>The pandemic has forced many young adults to pick up a job while juggling online college classes. What that looks like for Eduardo Jaime: working part-time in the fields while navigating his third year at Cal State San Bernardino.</p>","slug":"we-gotta-do-both-balancing-school-farm-work-in-coachella-valley","authorslug":"olivia-rodriguez-and-bryan-mendez"},{"type":"story","format":"print","feature":"false","location":"New York, NY","title":"Pandemic Took Young People’s Jobs, And Maybe Their Lifespans Too","author":"Lucy Barnam","org":"YR Media","date":"04/29/20","featureImage":"n_images/GettyImages-1250349580.jpg","featureImageCredits":"(Photo RichVintage/Getty Images)","featureImageCaption":"The COVID-19 pandemic is hurting young workers in California.","summary":"A conversation with Grecia Sánchez Blanco, a student who used to cross the U.S.-Mexico border daily for school.","text":"<p>Adrianne Ramsey, 25, remembers the Thursday afternoon her employer announced they would close. She had worked as a field trip explainer at the Exploratorium, a science museum in San Francisco, since 2018. She said the museum hadn’t unexpectedly closed its doors for an extended time since 9/11. </p>\n<p>“I honestly wasn't surprised when (that) happened,” she said of the museum’s closure last March. “It was just kind of crazy.”</p>\n<p>By May, the Exploratorium decided not to renew her contract, and Ramsey became one of the millions of Americans who lost their job due to the pandemic. Since she lost her job, Ramsey’s been living with family and working on independent projects, but she still doesn’t have full-time employment.</p>\n<p>“It's definitely been tough,” she said. “I mean, if I didn't have my projects, I don't think I'd be sane right now.”</p>\n<p>“The more frustrating thing is it's been (several) months, and I just feel like we've made very little progress as a country because we don't have a nationwide plan,” she continued. “It's just kind of depressing … just haphazard and pathetic.”</p>\n<p>California’s current unemployment rate is 4.3 percentage points higher than it was a year ago—<a class=\"link blue underline underline-hover hover-dark-red\" href=\"https://www.edd.ca.gov/newsroom/unemployment-december-2020.htm\" rel=\"nofollow\" target=\"_blank\">from 3.9% in November 2019 to 8.2% in November 2020</a>—because of the COVID-19 pandemic. The San Francisco Bay Area is far from immune: the <a class=\"link blue underline underline-hover hover-dark-red\" href=\"https://www.labormarketinfo.edd.ca.gov/file/lfmonth/oak$pds.pdf\" rel=\"nofollow\" target=\"_blank\">Oakland-Berkeley-Hayward metropolitan area reported a 6.8% unemployment rate in September compared to 2.7% a year ago</a>. <a class=\"link blue underline underline-hover hover-dark-red\" href=\"https://www.labormarketinfo.edd.ca.gov/file/lfmonth/sanf$pds.pdf\" rel=\"nofollow\" target=\"_blank\">San Francisco and the San Mateo County metro area reported a 5.4% rate compared to 1.9% last September.</a></p>\n<blockquote class=\"mh0 ph0 pv3 f4 f3-ns bt bb bw4 b--black\"><p class=\"ph3 fw7 lh-copy lh-title-ns\">“The more frustrating thing is it's been (several) months, and I just feel like we've made very little progress as a country because we don't have a nationwide plan. It's just kind of depressing ... just haphazard and pathetic.”</p></blockquote>\n\n<p>According to Till von Wachter, an economics professor at UCLA and faculty director of the California Policy Lab, industries that disproportionately employ young people, such as accommodation and food services, retail, and arts, entertainment and recreation, have been hit hardest by the pandemic. </p>\n<p>“COVID-19 has made certain types of activities much more dangerous than they were before, while others have remained relatively safe,” von Wachter said. “Many activities involving face-to-face contact with others or gathering in larger groups, also tend to employ younger workers … Black workers [and women have also] been hit exceptionally hard during the crisis.”</p>\n<p>He estimates the COVID-19 crisis could lead to a loss of over $2 trillion in lifetime earnings and 23 million work years across the US. Because losing one’s job cuts an average of 1.5 years off a worker’s lifespan, von Wachter estimates. </p>\n<p>While it’s been months since the pandemic began, many young adults who lost their jobs due to COVID-19 are still struggling to regain their footing. </p>\n<p>San Francisco resident Laura Fernandez, 23, said applying for jobs was the most challenging part of being unemployed during the pandemic. When she was laid off from her job at an \nafter-school program in August, she found many of the jobs she was interested in were either on hiatus or delayed in reviewing applications. Some employers took weeks to respond. She expected to dip into her savings while looking for work — but still, she said, it’s stressful to watch as her “savings get lower each time.”</p>\n<p>After scouring LinkedIn and Indeed for months—and several stressful Zoom interviews— Fernandez found a part-time job at a Bay Area radio station. She’s returned to her job at the school as-needed but is still looking for a third job to make ends meet. </p>\n<p>“It's been really stressful,” she said. “I knew that I still didn't have something solid...once you get out of college, you're expecting to hopefully be able to land a full-time job soon, you know? So, it was hard.”</p>\n<blockquote class=\"mh0 ph0 pv3 f4 f3-ns bt bb bw4 b--black\"><p class=\"ph3 fw7 lh-copy lh-title-ns\">“Some moments of hope were just knowing that I and my family have remained healthy and that this too shall pass.”</p></blockquote>\n\n<p>Being unemployed in any circumstances can be mentally taxing, but Fernandez and Ramsey said the pandemic had taken an additional toll on their mental health. Both of them said it’s easy to feel down right now, mostly because the pandemic has curbed coping mechanisms like traveling and spending time with others.  </p>\n<p>But both have found ways to relieve stress. Fernandez spends time with family and has returned to hobbies like painting, video editing and photography. She’s been taking advantage of this time by going on hikes and bonding with her roommates. </p>\n<p>Ramsey said she has tried to keep busy with independent projects while also trying to keep her loved ones safe.</p>\n<p>“Some moments of hope were just knowing that I and my family have remained healthy and that this too shall pass,” Ramsey said.</p>","slug":"pandemic-took-young-peoples-jobs-and-maybe-their-lifespans-too","authorslug":"lucy-barnam"},{"type":"story","format":"print","feature":"false","location":"New York, NY","title":"On the Front Lines: Reality of a Young Essential Worker","author":"Leonel Loera","org":"The kNOw","date":"04/29/20","featureImage":"n_images/IMG_8467_EDIT.jpg","featureImageCredits":"(Photo courtesy of Ivan Manriquez)","featureImageCaption":"Profile of two essential workers (grocery store/fast food) who are juggling school, work, and the risks of COVID.","summary":"Profile of a Fresno essential worker who is juggling school, work, and the risks of COVID-19.","text":"<p>When the pandemic hit, getting a job as an essential worker was a risk Ivan Manriquez knew he had to take. For the teen, who works part-time at a Fresno grocery store, the job is a way to contribute to the family bills while trying to save for the future. </p>\n<p>“I honestly do owe it to my mom to cover all of this for her because of everything she’s sacrificed for me over the years,” Manriquez said. “I’m 19. I don’t want to have to ask her for money.”</p>\n<p>He uses his check to contribute to the rent, pay car insurance, gas, phone service and save for college. With his older brother moving out, Manriquez knew he would need to help pick up the slack financially. </p>\n<p>Manriquez is one of the thousands of teenagers and young adults across California who are on the front lines working at grocery stores, fast food restaurants and big-box retailers. The work is demanding, but there’s also the worry that the job puts them at greater risk of contracting the virus.</p>\n<p>In California, many of the essential workers are youth of color. <a class=\"link blue underline underline-hover hover-dark-red\" href=\"https://laborcenter.berkeley.edu/front-line-essential-jobs-in-california-a-profile-of-job-and-worker-characteristics/\" rel=\"nofollow\" target=\"_blank\">According to the most recent data from UC Berkeley’s Labor Center,</a> 47% of essential workers are between the ages of 18-24. Latinx workers have the highest rate of employment in these jobs at 55% followed by 48% who are Black, 37% who are Asian, and 38% who are of other races.</p>\n<p>“I thought it was funny because just less than a year ago, people would just call this unskilled labor, and now it’s essential work,” Manriquez said. </p>\n<p>“I think it really hit me when Beyoncé did a video thanking all essential workers, and I was like, ‘She shouted me out.’ But I was also wondering at the time, now that this pandemic is shaking the table, what is the pay going to look like?”</p>\n<div class=\"center f7 gray\"><img loading=\"lazy\" class=\"db lazyload\" src=\"n_images/illustratio1.jpg\">\n(Illustration Ulonie Garza)</div>\n\n<p>At the grocery store where Manriquez works, the safety policy allows two weeks of time off for employees who have symptoms related to the virus. According to Manriquez, employees are getting sick faster, causing stress to the few still clocking in.</p>\n<p>“A lot of people are taking two weeks, which forces a lot of us to pick up more slack,” Manriquez said. </p>\n<p>Fever checks are also enforced, and results are not being disclosed to staff, he said. And this causes worry that some employees might come to work sick. </p>\n<p>“Me being me, I’m going to question everything. What if people have high temperatures, but they don’t want to send them home? They want to maximize profit; they don’t want to send these employees on time off,” he said.</p>\n<p>Perhaps one of the biggest concerns Manriquez has faced during these times is the potential of paid time off not being honored should he get sick or contract the virus. </p>\n<p>“It makes me kind of nervous because God forbid I develop these symptoms and have to call in for my two weeks,” he said. “It's affecting me and my comfort working and also my strictness with customers wearing masks. That’s scary to me.”</p>\n<p>According to the <a class=\"link blue underline underline-hover hover-dark-red\" href=\"https://www.dir.ca.gov/dlse/FAQ-for-PSL.html\" rel=\"nofollow\" target=\"_blank\">State of California Department of Industrial Relations</a>, workers who experience symptoms of COVID-19 should quarantine at home for 14 days. Employers are required to provide supplemental paid sick leave under executive order <a class=\"link blue underline underline-hover hover-dark-red\" href=\"https://www.gov.ca.gov/wp-content/uploads/2020/04/4.16.20-EO-N-51-20.pdf\" rel=\"nofollow\" target=\"_blank\">N-51-20</a>. </p>\n<p>Being an essential worker isn’t easy, especially when customers act rude. Manriquez said there was a time when a customer whistled at him like you would do to grab a dog's attention. </p>\n<p>“That’s one thing I do not like,” Manriquez said. “That stems from their ignorance. That’ll always be a challenge for me, dealing with customers when my patience is at a low. But also, I have to find the inner strength not to be so passive-aggressive. I’ve been blessed with this opportunity to help out my mom by working and to be a solid employee.”</p>\n<blockquote class=\"mh0 ph0 pv3 f4 f3-ns bt bb bw4 b--black\"><p class=\"ph3 fw7 lh-copy lh-title-ns\">\"As much as I don’t want to work right now, I have to. One, to make money, (and) two, for the experience.\"</p></blockquote>\nStill, Manriquez smiles and recounts the silver lining of the situation: not all customers are bad.\n\n<p>“I’ll be honest; there are some really genuine customers who have the energy to help us help them in any way that they can,” he said. </p>\n<p>Often essential workers consider whether they should work to make money or stay safe and healthy. In some cases, it's not even a debate.</p>\n<p>“If it had to be a battle, work would win because I do have to help my mom,” he said. “I do have to save up for college. As much as I don’t want to work right now, I have to. One, to make money, (and) two, for the experience. Building a resume is important to me.”</p>","slug":"on-the-front-lines-reality-of-a-young-essential-worker","authorslug":"leonel-loera"},{"type":"story","format":"print","feature":"false","location":"New York, NY","title":"No Easy Choices: Stay in School or Pay the Rent?","author":"Jennifer López","org":"Boyle Heights Beat","date":"04/29/20","featureImage":"n_images/terra_mia_coffee.jpg","featureImageCredits":"(Photo Jacqueline Ramirez/Boyle Heights Beat)","featureImageCaption":"Profile of a college student who has dropped to part-time to work and help support family who was affected by COVID, both virus itself and reduced work hours of parent; Struggling with having to work and not doing well with virtual classes; deciding whether to take a semester off or drop to a part-time student.","summary":"Profile of a college student who has dropped to part-time to work and help support family who was affected by COVID, both virus itself and reduced work hours of parent; Struggling with having to work and not doing well with virtual classes; deciding whether to take a semester off or drop to a part-time student.","text":"<p>When 20-year-old Saul Soto decided to commit to community college last year, he never imagined there would be an international pandemic or that his mother, the family’s main source of income, would have her hours at work cut in half. </p>\n<p>Soto’s mother, Araceli, is a single mom, waits tables at a local restaurant. When restaurants shut down in the spring, so did her work. Even when they reopened, her hours weren’t back to where they were before the pandemic. When restaurants closed again in November, open only for takeout and deliveries, her hours were reduced yet again. </p>\n<p>Since the pandemic began, the family has struggled to make ends meet and disagree on what is most important. Soto thinks he should leave school entirely, while his mother wants him to continue with his studies. At the same time, all of Soto’s classes at East Los Angeles College (ELACC) are online and he’s finding it difficult to learn and stay motivated. Like many students in California, Soto struggles with a parent losing their job, a family member testing positive for COVID-19, the inability to pay rent and the possibility of losing their home.  </p>\n<blockquote class=\"mh0 ph0 pv3 f4 f4-ns bt bb bw4 b--black\"><p class=\"ph3 fw7 lh-copy lh-title-ns\">“We’re not in a place where we can say we have security,” Soto said. “I tell my mom we’re just one paycheck away from getting kicked out.”</p></blockquote>\n\n<p>Many students like Soto have had to decide whether or not to continue in school due to the pandemic. Across the country, colleges this fall have seen a 22% drop in freshman enrollment compared to last year, according to a <a class=\"link blue underline underline-hover hover-dark-red\" href=\"https://nscresearchcenter.org/high-school-benchmarks/\" rel=\"nofollow\" target=\"_blank\">national survey. </a> The survey, by the National Student Clearinghouse Research Center, found that students of underrepresented minorities and low-income students have seen the largest decreases.  </p>\n<p>California is no exception. In November, California Community College Vice Chancellor Lizette Navarette told the State Assembly that community college students had been the hardest hit in all of higher education — with a preliminary survey showing fall enrollment down 7% and full-time enrollment down 10%. </p>\n<p>“Low income and older students were more likely to pause education for fall due to interruptions in income,” Navarette told committee members.  </p>\n<p>A <a class=\"link blue underline underline-hover hover-dark-red\" href=\"https://www.csac.ca.gov/sites/main/files/file-attachments/2020_covid19_student_survey.pdf?1594172054\" rel=\"nofollow\" target=\"_blank\">COVID-19 student survey </a>this summer by the California Student Aid Commission of nearly 50,000 students found more than half reported a decrease in income due to the pandemic. Out of the students who participated in the survey, 60% said they were food insecure or experiencing housing insecurity or homelessness. Rates were highest among non-white students.  </p>\n<div class=\"grid-two-col\"><div class=\"\"><div class=\"relative\"><img loading=\"lazy\" class=\"db fit-cover mw5-ns\" src=\"n_images/Saul_.jpg\"><div class=\"f7 gray absolute\">(Photo: Saul Soto, a student at East Los Angeles College)</div></div></div><div class=\"flex flex-column justify-center bt bb bw4 b--black\"><blockquote class=\"f3\"><p class=\"ph3 fw7 lh-copy lh-title-ns\"> “I need to work to make sure I’m able to provide for my family. It’s pushing me away from my education right now. As a man in the house, I need to help out.”</p></blockquote></div></div>\n\n\n\n<p>Soto says since the pandemic, he’s felt pressure to drop out of school and concentrate on working and helping his mother. Fall semester, he juggled five classes and 20- to 30-hour work weeks — trying to help his family out financially while still earning enough credits to eventually transfer to a four-year college. </p>\n<p>On a typical day without classes, he works a six-hour shift at a coffee shop in Huntington Park, about six miles from his East Los Angeles home. Before the pandemic, Soto says he worked to have money to go out on the weekends, but now things have changed.</p>\n<p>“I need to work to make sure I’m able to provide for my family,” he said. “It’s pushing me away from my education right now. As a man in the house, I need to help out.”</p>\n<p>Eileen Le, one of Soto’s professors at ELACC, says she notices a shift happening in some of her classes. While her sociology classes typically have more women than men, she says she sees fewer male students in her Zoom lectures. Le believes many may be choosing employment over education, especially during the pandemic.</p>\n<p>“The economic downturn post-COVID speaks to the immediacy of young men mostly, but women too, to hold school off and bring some money home,” Le said.</p>\n<p>Meanwhile, Araceli is worried about her son dropping out of college.  She wants him to stay in school and work towards his degree despite their financial hardship. </p>\n<p> “This pandemic will pass at some point, and if you’re prepared, it will be easier to find another job where you are paid more based on your academic level,” Araceli Soto said. </p>\n<p>Her instinct is good.<a class=\"link blue underline underline-hover hover-dark-red\" href=\"https://nscresearchcenter.org/wp-content/uploads/SCND_Report_2019.pdf\" rel=\"nofollow\" target=\"_blank\"> A 2019 study by the National Student Clearinghouse Resource Center</a> shows that once a college student drops out of school, fewer than 1 in 5 return.  The likelihood of returning to college after taking just one year off decreases by 30%.</p>\n<p>Soto said he’s more worried about the present.  “The future doesn’t matter if we’re broke and starving right now,” Soto said. </p>\n<p>Now that restaurants have closed once again for in-person dining, Soto said he might have to find another part-time job.  With work slow for both him and his mother, he feels he doesn’t have much choice but to take the Spring semester off. </p>\n<p>“I really wish I could do more,” Soto said. “I wish I could make my family happy by getting an education, but I need to make sure we have enough money, so we’re not broke.”</p>","slug":"no-easy-choices-stay-in-school-or-pay-the-rent","authorslug":"jennifer-lopez"}],"main":{"type":"about","latest":[{"title":"Pandemic Took Young People’s Jobs, And Maybe Their Lifespans Too","slug":"pandemic-took-young-peoples-jobs-and-maybe-their-lifespans-too"},{"title":"“We Gotta Do Both” Balancing School, Farm Work in Coachella Valley","slug":"we-gotta-do-both-balancing-school-farm-work-in-coachella-valley"},{"title":"No Easy Choices: Stay in School or Pay the Rent?","slug":"no-easy-choices-stay-in-school-or-pay-the-rent"},{"title":"On the Front Lines: Reality of a Young Essential Worker","slug":"on-the-front-lines-reality-of-a-young-essential-worker"}],"about":{"text":"<p>We are 18- to 29-year-olds. And we have the most at stake in the 2020 election. There is a lot of speculation in mainstream media about which candidate we will vote for and how many of us will actually go to the polls, but very little attention paid to our actual experiences and perspectives when it comes to the issues being debated on the national stage. These issues are more than talking points for us. They are the struggles that define our communities and our futures. They are our stories, they need to be told and we want to be the ones to tell them. Follow us as our perspectives are featured here and on partner outlets over the months leading up to the general election.</p>\n<p><a class=\"link blue underline underline-hover hover-dark-red\" href=\"https://yr.media/\" rel=\"nofollow\" target=\"_blank\">YR Media</a> and <a class=\"link blue underline underline-hover hover-dark-red\" href=\"https://www.wnyc.org/shows/rookies\" rel=\"nofollow\" target=\"_blank\">WNYC’s Radio Rookies</a> carried out a national contributor search. From more than one hundred applications to our open call for contributors, we selected a team of 13 talented young media makers. Contributors are racially and ethnically diverse, identify across the political spectrum, and represent every region in the country. With support from YR Media and Radio Rookies editorial staff, they are producing content in audio, video, and print formats on issues including race and criminal justice, #BlackLivesMatter, health care access, poverty, education, LGBTQ rights, college affordability, homelessness, opioid addiction and immigration. Check out an <a class=\"link blue underline underline-hover hover-dark-red\" href=\"https://pndblog.typepad.com/pndblog/2020/08/report-or-vote-young-bipoc-journalists-can-and-should-do-both.html\" rel=\"nofollow\" target=\"_blank\">OpEd from YR Media's CEO</a> on where this project fits in history. Also, don’t miss our collaboration with <a class=\"link blue underline underline-hover hover-dark-red\" href=\"http://bit.ly/psxyrmedia\" rel=\"nofollow\" target=\"_blank\">POPSUGAR</a>.</p>","credits":"The 18-to-29 Now: Young America Speaks Up project is made possible in part by the following supporters of YR Media and WNYC: John D. and Catherine T. MacArthur Foundation, the Ford Foundation, the Annie E. Casey Foundation, Margaret Neubart Foundation and Newman’s Own Foundation."},"header":{"copy":"From now through November 3rd, young adults from around the country document what’s at stake for them in the 2020 election."},"footer":{"text":"<p><b class=\"serif\">18-to-29 Now: Young America Speaks Up</b><br>\nYoung adults from around the country document what’s at stake for them in the 2020 election.</p>\n<p>Produced by YR Media and WNYC.</p>","newsletter":{"text":"<p>By submitting your information, you’re agreeing to receive communications from YR Media in accordance with our <a class=\"link blue underline underline-hover hover-dark-red\" href=\"https://yr.media/privacy-policy\" rel=\"nofollow\" target=\"_blank\">Privacy Policy</a> and from New York Public Radio in accordance with their <a class=\"link blue underline underline-hover hover-dark-red\" href=\"https://www.wnyc.org/terms\" rel=\"nofollow\" target=\"_blank\">Terms of Use</a>.</p>"}},"credits":{"title":"Credits","people":[{"title":"Reporters","names":"Sydney Livingston, Ariel Tang, Zoe Harwood","slug":"reporters"},{"title":"Editors/Producers","names":"Nimah Gobir, Marjerrie Masicat, Lissa Soep","slug":"editors-producers"},{"title":"Designer","names":"Marjerrie Masicat","slug":"designer"},{"title":"Developers","names":"Radamés Ajna, Devin Glover","slug":"developers"},{"title":"Audio Editors","names":"Galnadjee Joe-Johnson, Jacob Armenta","slug":"audio-editors"},{"title":"Researcher","names":"Rainier Harris","slug":"researcher"},{"title":"Project Lead","names":"Nimah Gobir","slug":"project-lead"}],"slug":"credits"}}}