{"stories":[{"type":"story","feature":"true","format":"text","title":"I’m Conservative, and Covid-19 Brings Conflicts of Political Interest","author":"Kelvey Vander Hart","date":"04/29/20","location":"Des Moines, IA","featureImage":"articles/kelvey_conflicts-of-political-interest_feature-edit.jpg","featureImageSmall":"articles/kelvey_conflicts-of-political-interest_feature-edit-small.jpg","featureImageCaption":"Young woman in quarantine wearing a mask and looking through the window.","featureImageCredits":"Photo: Mario Guti/Getty Images","summary":"A young conservative libertarian from Iowa thinks through her politics in the wake of the coronavirus pandemic and COVID-19 hitting her community hard. What happens when you don't have the answers?","text":"<p>When COVID-19 arrived in the United States, it brought so many questions with it. Scary questions. Questions about our jobs and our social networks and our collective well-being.</p>\n<p>But for me, it also brought hard ideological questions. COVID-19 forced me to ask myself, “How do I reconcile my political ideology with what is going on all around me?”</p>\n<p>I identify as a conservative-libertarian, a conservatarian for short. I joke that when I am around my conservative friends I am shocked by what they want the government to be doing, and when I am around my libertarian friends I am shocked by what they do not want the government to be doing. If I had to summarize my political beliefs, I just want limited and fiscally responsible government, empowered individuals and justice and liberty for all.</p>\n<p>There is one very big difference that separates this cultural moment from those before it: I have no context or previous framework to help me figure things out. Where I live in Iowa, many businesses are still closed (even as other parts of the state slowly reopen) and I keep reading about federal spending going up and up. While I’m concerned about the huge deficit numbers and civil liberties, my first pandemic is a whole new ballgame and I’m lacking arguments and solutions that only come with prior experience.</p>\n<p>The dichotomy between my political views and the response to COVID-19 only becomes more apparent when I think about my loved ones. All of my immediate family members and many of my close friends have had their lives dramatically impacted by this pandemic in some way. And when I sit and listen to their experiences, any answers I have seem insufficient.</p>\n<p>My insufficient answers show themselves in my parents’ living room as we worry together about whether or not my father can remain self-employed in social media marketing and communications after this is over. They linger uncomfortably in the back of my head as I wait to hear back from my severely at-risk mother about whether or not she tested positive for COVID-19. They are still there when I drive my father to the emergency room myself after he starts showing symptoms weeks later.</p>\n<p>The insufficiency is obvious as I wonder when my little brother Morgan, temporarily laid off from his position at a local coffeeshop, will be able to go back to work. Is unemployment for the sake of public health preferable to ruining the financial livelihood of so many? What can be done here? What should be done here? But just when I think lockdown is the wrong answer to this issue, I talk to my sister Lily, a nursing student, who makes a case for why it should continue.</p>\n<p>Insufficient answers are right there with me as I talk with her what is happening in the hospital where she works. They are there as my heart breaks with her while she talks about changes on her hospice floor because of COVID-19: “My heart kind of broke because I had patients who were dying and they could only have two family members [present].”</p>\n<p>I feel the weight of my insufficient answers when I talk with my best friend J. as he runs himself ragged trying to ensure the health of the team he manages in a big box store that’s still open. We often agree politically and so the gravity of this situation hit even harder when he said, “It is really difficult because, from my political perspective, I don’t like to set precedents where the government can lock anything down that the private sector is doing. I want the private sector to be free from regulation. But, right now, the safety and public health of the entire state is very close in my mind to outweighing the dangers of the precedent that would be set…”</p>\n<p>The quest to figure out what I think in the midst of this pandemic is only complicated by the anti-shutdown rallies happening around the country. As I struggle alongside others with similar political beliefs to figure out what I think the solutions should be during this unprecedented time of hardship and heartache, I can’t help but notice we are underrepresented in the media. While many of us sit quietly and try to reason through this, we are represented by the loud and nominal few who shirk the responsibility we have to our communities in favor of being able to open up their cities and keep their summer vacation plans.</p>\n<p>So how do I reconcile my political ideology with what is going on around me? I have been wrestling with this question for weeks, only to come to the same conclusion every time: I don’t know. Maybe I’ll figure it out before all this is over, but I have a feeling that clear answers will only come in retrospect.</p>","slug":"im-conservative-and-covid-19-brings-conflicts-of-political-interest","authorslug":"kelvey-vander-hart"},{"type":"story","feature":"false","format":"video","location":"St. Paul, MN","videourl":"https://www.youtube.com/watch?v=VDh-k0YZ-JE","videoid":"VDh-k0YZ-JE","title":"Barely Making It: Navigating 2020 As a Broke College Student","author":"Erianna Jiles","date":"06/02/20","featureImage":"articles/Erianna_Jiles2.jpg","featureImageSmall":"articles/Erianna_Jiles2-small.jpg","summary":"Erianna Jiles takes us through what it's like to be a college student trying to make it, and how the 2020 election could affect her and other first-generation students in the same situation.","text":"<p>Erianna Jiles takes us through what it's like to be a college student trying to make it, and how the 2020 election could affect her and other first-generation students in the same situation.</p>","slug":"barely-making-it-navigating-2020-as-a-broke-college-student","authorslug":"erianna-jiles"},{"type":"story","feature":"true","format":"text","title":"Getting on Board with Kamala: It's Complicated","author":"Sher Delva","date":"08/19/20","location":"Boynton Beach, FL","featureImage":"articles/sher-getting-on-board_feature-edit.jpg","featureImageSmall":"articles/sher-getting-on-board_feature-edit-small.jpg","featureImageCaption":"Sen. Kamala Harris (D-CA), running mate of Presumptive Democratic presidential nominee former Vice President Joe Biden, is the first Black woman and first person of Indian descent to be a presumptive nominee on a presidential ticket by a major party in U.S. history.","featureImageCredits":"Photo: Drew Angerer/Getty Images","tags":"Healthcare, Race","summary":"Kamala Harris makes history as the first woman of color nominated for national office by a major party. Sher Delva explains why embracing Harris means letting go of some of her socialist dreams.","text":"<p>When Joe Biden announced Senator Kamala Harris as his pick for vice president, to say I was surprised would be a lie. For the most part, Biden and Harris share similar political views and appeal to the Democratic establishment. As a Black woman, I am aware of the impact having a woman of color on the ballot has on voter turnout. Harris has also proven on the debate stage to have the tenacity and energy to add much-needed fuel to Biden's campaign. Despite my aversions, I believe Harris's name beside Biden's will help his campaign more than it will hurt it. The choice, at the very least, is a logical one.</p>\n<p>Still, I'd be lying if I said I was not disappointed. It was not long ago I was processing the disappointment of Senator Bernie Sanders's presidential defeat. I remember the Zoom calls I joined among members of progressive organizations like the Democratic Socialists of America and the Sunrise Movement. All of us asked the same question: Where do we go from here? I do not think Harris on the ballot provides any reassurance. When I heard Sanders talk about his relentless pursuit of accessible healthcare and education, I felt hope for the first time in years. Where has that gone? Where does that leave me?</p>\n<p>The answer among my comrades is split. However, I have decided to vote in November, despite not believing much will change. While I will credit Harris for supporting important issues like the Green New Deal and vowing to eliminate private prisons, I also have to call out her inconsistencies. Harris went from stating she supported Medicare for All at a town hall to flip-flopping and saying she <a class=\"link blue underline underline-hover hover-dark-red\" href=\"https://www.cbsnews.com/news/kamala-harris-continues-to-clarify-her-stance-on-medicare-for-all/\" rel=\"nofollow\" target=\"_blank\">misheard the question</a>. She then confirmed her support for the for-profit private insurance industry. Yes, a Biden ticket is more likely to be malleable to implementing progressive policies, but I am not optimistic. </p>\n<p>Regardless, I choose potential stagnation over regression or, worse, a travesty. As a young voter in a flip state like Florida, I know my vote matters. I want to acknowledge the positive precedent having a female vice president of color will set for the future. I am a Black woman, and I know that option did not exist before. I want to maintain that awareness.</p>\n<p>I understand that four more years of President Donald Trump will gravely affect our most vulnerable citizens, so I am doing my part. I want to look back and know I made the best possible choice I could. As Sanders’s campaign slogan said, it's not me, it's us.</p>","slug":"getting-on-board-with-kamala-its-complicated","authorslug":"sher-delva"},{"type":"story","feature":"false","format":"audio","location":"St. Paul, MN","audioURL":"https://www.podtrac.com/pts/redirect.mp3/audio.wnyc.org/radiorookies/radiorookies071320_eriannajiles.mp3","title":"A Minnesotan Weighs In: Is There Hope After the Hashtags?","author":"Erianna Jiles","date":"06/04/20","featureImage":"articles/AmemorialsiteGeorge-Floyd-edit.jpg","featureImageSmall":"articles/AmemorialsiteGeorge-Floyd-edit-small.jpg","featureImageCaption":"A memorial site where George Floyd died while in police custody in Minneapolis.","featureImageCredits":"Photo: Stephen Maturen/Getty Images.","summary":"The killing of George Floyd has led many people to consider what they and those around them think about race in America. Erianna Jiles has been frustrated, but encouraged that maybe we’re at a turning point.","text":"<p>I grew up in St. Paul, and as an African-American, I know there is racism here, but I rarely see it actively on display. In South Minneapolis, where George Floyd died, most of the people I’ve met are super liberal and white people who “care.” The murder happening in this neighborhood, makes me question the Minnesota I know. </p>\n<p>The image of Derek Chauvin’s knee on Floyd’s neck keeps replaying in my head. To me, it represents a metaphor for the experiences that African-Americans face daily. Some days I feel like I can’t breathe because it’s hard for Black people in this country to catch a break — from racism, police brutality and COVID-19. I don’t understand why just our existence often seems threatening.</p>\n<p>Since Floyd’s death, I’ve felt anxious and exhausted. I’ve just had to take a break. It’s too much pressure to deal with my emotions while social media is flooded with opinions from so many people.  </p>\n<p>At 22 years old, I know that to see real change in this country, we need all people that don’t look like me to stand up. The response to Floyd’s death feels more inclusive, but it’s deeper than showing up to protests with your “Black Lives Matter” sign.</p>\n<p> What will life look like when the protests end and the hashtags disappear? Will you still be our voice to challenge injustice? Will you urge officers to abide by their oaths and finally protect people that look like me?</p>\n<p>These last few weeks have left me questioning my four white roommates. Since the incident, I haven’t heard a word from them. It’s confusing that they can attend rallies and stand up for Black lives but can’t check on the one Black person they share a house with. </p>\n<p>I understand this makes for uncomfortable conversations, but it is time. If we don’t start this dialogue, we’ll continue with a generation of police officers like Chauvin or the many Amy Coopers of our society who don’t understand **why **reporting fake crimes against Black people can be deadly. </p>\n<p>I have hope we might be at a crossroads for change. So I’m committed to talking to my white friends, peers and now my roommates about how we can create a better understanding of one another and bridge the gap. </p>\n<p>In return, all I ask is that white people engage themselves in conversations, be open-minded to hearing experiences they’ve never had before and not ignore the signs of racism just because it’s easier at the moment. </p>\n<p>Ultimately, I can only hope for a society that treats me like my life matters. </p>\n<p><i>Also featured on NPR/WBUR’s <a class=\"link blue underline underline-hover hover-dark-red\" href=\"https://www.wbur.org/hereandnow\" rel=\"nofollow\" target=\"_blank\">Here and Now</a>.</i></p>","audioWaveform":"WzAuNzcsMC42MjQsMC42NzYsMC44NzksMC4zMjksMC42NjIsMC42MzQsMC42NjgsMC44MTgsMC40MDYsMC43NjUsMC42NDQsMC42MDEsMC40MzksMC42MTksMC41MjQsMC4zNTEsMC41NiwwLjU2LDAuNjExLDAuNDMyLDAuMzQ3LDAuNDUsMC40MjksMC4zMzIsMC4zNzMsMC40NywwLjQxOSwwLjE4NSwwLjgxNSwwLjc2MSwwLjQ4OCwwLjIwMiwwLjY2LDAuNDczLDAuNDE3LDAuNDQzLDAuNjc2LDAuNDk1LDAuODEyLDAuNjI1LDAuNDMxLDAuOTE0LDAuNzQyLDAuNTYzLDAuOTA4LDAuNDY2LDAuNDU3LDAuNzgsMC42OSwwLjczNywwLjUyNiwwLjUyLDAuNjAzLDAuNTM4LDAuNDg0LDAuODM0LDAuMjk1LDAuODUxLDAuNzI3LDAuNTgsMC4zLDAuNTI1LDAuNjM2LDAuMzQ3LDAuNjk1LDAuNzM0LDAuNTQ1LDAuNzAxLDAuNTg5LDAuODA3LDAuNTQyLDAuMDM2LDAuODYyLDAuNDU0LDAuNTU3LDAuOTE0LDAuNzY0LDAuNTQ4LDAuNTUzLDAuNTE5LDAuNTI1LDAuNjMsMC41MzIsMC40MywwLjI5MiwwLjgzMiwwLjM0MywwLjYzMSwwLjQ4MiwxLDAuNzQ2LDAuNjY0LDAuNjcsMC4yNjEsMC44NDgsMC41OTYsMC41NDUsMC4zNjQsMC40ODUsMC42LDAuNjU5LDAuNTU5LDAuNDUsMC4xODcsMC43MzMsMC42MzYsMC41MDksMC4zMjksMC4wMDJd","slug":"a-minnesotan-weighs-in-is-there-hope-after-the-hashtags","authorslug":"erianna-jiles"},{"type":"story","feature":"false","format":"audio","location":"Stockton and San Francisco, CA.","audioURL":"https://www.podtrac.com/pts/redirect.mp3/audio.wnyc.org/radiorookies/radiorookies071320_juanmireles.mp3","title":"Life in Legal Limbo: A Dreamer Reflects","author":"Juan Mireles-Palomar","date":"06/04/20","featureImage":"articles/juan_life-in-legal-limbo_feature-edit.jpg","featureImageSmall":"articles/juan_life-in-legal-limbo_feature-edit-small.jpg","featureImageCaption":"Juan Mireles-Palomar with his father and sister.","featureImageCredits":"Photo: Courtesy of Juan Mireles-Palomar.","summary":"Juan Mireles-Palomar has to navigate the politicized nature of his immigration status. He gets into the conflicting feelings he has about how his legal status plays a role in his future — and his sister's.","text":"<p><b>Juan:</b> [Talking on telephone] How’s my mom?</p>\n<p><b>Eva:</b> [Talking on telephone] She’s doing good. I went to her house the other day. Have you talked to her? </p>\n<p><b>Juan:</b> This is my older sister Eva. She is someone I have always looked up to because she is a badass, resilient, and like my favorite Powerpuff girl, Buttercup. The green one. </p>\n<p><b>Juan:</b> [Talking on telephone] Yeah, she FaceTimed me and showed me her new house.</p>\n<p><b>Eva:</b> [Talking on telephone] I know, I’ve seen it. I went over last week or two weeks ago. It’s hecka cute. Her kitchen is hecka big and Sofi has her own room. She was running around showing me her room and showing me all of her stuff.</p>\n<p><b>Juan:</b> [Talking on telephone] Oh, I miss Sofi. She’s so cute…</p>\n<p><b>Juan:</b> When we were little, Eva and I would play all day outside until the sun came down. We both loved Rihanna, had the same taste in ice cream. In many ways we were the same, except for our legal status, which divided us. I was undocumented, while she had papers, which meant she had access to opportunities that I didn’t. </p>\n<p>[Music plays]</p>\n<p><b>Juan:</b> In high school, the majority of my friends were already working and getting their driver’s licenses. But because of my legal status, I couldn’t. My sister Eva could though. She was a year older and she had first priority when it came to obtaining documentation. My parents paid for her to apply for the Deferred Action for Childhood Arrivals program, or DACA, but they couldn’t pay for both of us.</p>\n<p><b>Eva:</b> Oh, it made all of the difference, having DACA. Having that now meant that I can go and pursue my dreams, go to college, get a job, earn money for myself, make myself an independent person. That just meant everything. It was a life changer, you know. </p>\n<p><b>Juan:</b> That’s what I wanted too. But during my junior year of high school, my dad was unexpectedly deported back to Mexico. Without my dad around, my mom’s job at a flower nursery wasn’t enough to cover the bills and play for the DACA application of $495. Also, it was almost impossible for me to find a job without DACA. The only other option in Stockton, California was to go to work in the fields. So during my senior year, I got a job in a fruit packaging warehouse and I got paid under the table, like most undocumented field workers. </p>\n<p>[Music changes]</p>\n<p><b>Juan:</b> Everyday after school, I rush over to this big stuffy warehouse and start packaging cherries. I stand at the same spot for hours, trying to move my hands and open the bags faster than the cherries falling on the ground. I’m exhausted. And I’m thinking to myself, “Why is this my only option? Why can’t I just have a regular job like my friends or Eva? And can this damn machine slow down?!” </p>\n<p>Eventually the bell rings, notifying us it’s time to clock out. By now, It’s 1 a.m. I go home and start whatever homework I have due the next day. This was my routine my senior year. School. Work. Grieve for my dad in silence. Repeat. My goal was to save up for my DACA application, but the reality is most of the money went to help around the house. As my senior year was coming to an end, it became more urgent. I was scared I would have to put off college. But then I got a surprise.</p>\n<p><b>Juan:</b> [Paper crinkles] Here’s the note I got…”Sometimes the American Dream comes true … with a little help. Never stop dreaming. From: those who believe in you.”</p>\n<p><b>Juan:</b> As a graduation gift, my teachers pooled money together to pay the full amount of my DACA application. I was so overwhelmed with emotions, I couldn’t believe it! I turned in my application just before Trump’s election. It would take nearly a year until I finally received my official Employment Authorization Card. I finally had temporary legal status. I immediately applied for a job, opened a bank account, got my drivers license, saved up some money and moved out of my house to the city. </p>\n<p>All the things I wanted to do but couldn’t before getting DACA. I wanted to take full advantage of the opportunities I now had, or at least temporarily had. So I was able to find a job at a fashion boutique store and a place to live, I was able to buy my own bed and my own furniture. I was doing things all on my own. On the other hand, my sister? She let her DACA expire. She didn’t want to continue paying the money. We ended up on opposite paths again.</p>\n<p><b>Eva:</b> Now I’m looking at it like you’re so dumb. “You should have just paid the five hundred dollars.” It was so hard for me after that. I struggled more without it. [Back] then, I would have struggled without those five hundred dollars at the time. </p>\n<p><b>Juan:</b> She had to move back home, and lost some of the independence I admired in her. I got a taste of what my sister went through once the coronavirus pandemic hit. I was starting to feel comfortable in my new adult life when the governor ordered the closure of non-essential businesses. Clearly that meant my job at the boutique would close, and I was furloughed. The idea of losing my job scared me, and I figured I’d be back where I started. Then I learned that I would be eligible for unemployment benefits through the state of California, something my sister Eva can’t access because of her current status.</p>\n<p><b>Eva:</b> No government aid, no government funding, nothing because I’m not documented.</p>\n<p><b>Juan:</b> Despite her legal status, my sister is still working. She works at a restaurant in Stockton.</p>\n<p><b>Eva:</b> Luckily my work didn’t get shut down but I know other jobs did, a lot of other restaurants did. My hours have gotten cut about like five to six hours a week and now I need as much hours as I can. Because I just moved out but yeah, this thing has cut back on my hours. Coronavirus. [Laughs]</p>\n<p><b>Juan:</b> [Laughs] I totally feel that. They completely cut my hours.</p>\n<p><b>Eva:</b> I know, you lost your job! It’s crazy. That’s why I’m fortunate to have mine and I’m fortunate to have the hours that I do have and I’m just hoping for it to go back to normal because I want to work my full hours. </p>\n<p><b>Juan:</b> This lockdown is more than a matter of health for families like ours. It’s about whether or not there will be food on the table or even a place to live. If you are undocumented, you don’t qualify for the Federal CARES Act, which provides economic assistance for U.S. citizens. But in April, Governor Newsom announced his plan to get $75 million in statewide funds for immigrant families impacted by COVID-19. However, it’s not clear if my family will get any of those limited funds. So we still have reason to worry.</p>\n<p><b>Eva:</b> If I stopped working that would mean my income would completely stop. I would have no income at all. Because unlike citizens who lose their job and can go and sign up for unemployment and receive some money to help them, I can’t.</p>\n<p><b>Juan:</b> The truth is, even if both of us had DACA, my sister Eva and I are both still in limbo. This program for young immigrants like us has been debated in Congress and threats to end it are ongoing. While the Supreme Court upheld the program for now, it’s fate will probably depend on the next presidency — Trump or Biden. But for now, my sister and I have each other’s back no matter what, even though we still can’t decide on which Rihanna song is best.</p>\n<p><i>Also featured on <a class=\"link blue underline underline-hover hover-dark-red\" href=\"https://www.radiotopia.fm/podcasts/adult-ish\" rel=\"nofollow\" target=\"_blank\">Adult ISH podcast</a> distributed by Radiotopia.</i></p>","audioWaveform":"WzAuNzc0LDAuMjc2LDAuNTYxLDAuNDYyLDAuNjUxLDAuNTg3LDAuMzYyLDAuNzY5LDAuNjMsMC42MTUsMC40NzIsMC40MzEsMC40MjUsMC41ODUsMC41MjYsMC41ODUsMC41MiwwLjY3OSwwLjQ4OSwwLjQ4NCwwLjU1LDEsMC45NzEsMC44MjMsMC43NSwwLjU2NiwwLjQyNSwwLjU4NiwwLjQxOCwwLjUzNiwwLjY0NywwLjQ3NywwLjM0NiwwLjc2NSwwLjYzNiwwLjcsMC40NDUsMC42MjgsMC43NjIsMC40ODksMC41NTgsMC41NzcsMC4zODgsMC4zNzEsMC40MjEsMC40LDAuNTYyLDAuNDU5LDAuNTQ5LDAuNDQ3LDAuNDQyLDAuNTIyLDAuMjYzLDAuNjAxLDAuNzcsMC4zMzUsMC40NzYsMC40NzEsMC40MTQsMC40OTMsMC40NDIsMC40NDIsMC40ODIsMC4zODksMC41MjQsMC40ODYsMC41ODYsMC4zNjUsMC41MjcsMC40OTIsMC42NTMsMC41NDYsMC42MDMsMC40MTMsMC40NjksMC40NTUsMC40NzMsMC40NzMsMC4zMTYsMC41NDksMC40ODUsMC42MzgsMC40MDUsMC43MzEsMC45MTYsMC42MDUsMC41ODYsMC40NDUsMC40MTQsMC40OTQsMC42MDIsMC40NzcsMC40ODgsMC41NzgsMC40NzYsMC40ODIsMC40NjMsMC40NTMsMC40ODUsMC40NzYsMC41MzEsMC40NjIsMC40OTgsMC40MjEsMC4zMzUsMC41OTksMC42MDksMC44MjgsMC44MDYsMC4yMjhd","slug":"life-in-legal-limbo-a-dreamer-reflects","authorslug":"juan-mireles-palomar"},{"type":"story","feature":"false","format":"audio","location":"Boynton Beach, FL","audioURL":"https://www.podtrac.com/pts/redirect.mp3/audio.wnyc.org/radiorookies/radiorookies102020_sherdelva.mp3","title":"A Democratic Socialist on Election 2020: ‘I’ll vote for Biden but I want more for the country’","slug_custom":"to-move-forward-after-bernie-a-young-progressive-looks-to-the-past","author":"Sher Delva","date":"10/21/20","featureImage":"articles/sher_young-progressive_feature-edit.jpg","featureImageSmall":"articles/sher_young-progressive_feature-edit-small.jpg","featureImageCaption":"Sher Delva poses for a photo with several other Bernie Sanders supporters during a debate watch party in January 2020.","featureImageCredits":"Photo: Courtesy of Sher Delva","summary":"Bernie Sanders' run for president may be over but the young people at the center of it are still politically engaged. Sher Delva reflects on her political awakening and wonders what comes next.","text":"<p>I remember how I felt the night Barack Obama won the 2008 presidential election, I was 15 years old and I thought I was lucky to be alive, that the world was changing and I was a part of it. It was a monumental moment, especially for Black people.  </p>\n<p>In my mother’s living room, there’s a black and white photo of Martin Luther King Jr.’s  face photoshopped beside Barack Obama. I asked my mom about why it’s so meaningful to her, and she told me she hoped her grandchildren would one day see it over and over, “to remind them they can be anything in America.” Then she laughed, “I didn’t pay a lot for it! I only paid $10 for it. But that picture I wouldn’t give it up for half a million! That’s how much it’s worth to me.”</p>\n<div class=\"center f7 gray\"><img loading=\"lazy\" class=\"db lazyload w-100\" src=\"articles/sherdelva_mom_obamaMLK.jpg\">\n(Photo courtesy of Sher Delva)</div>\n\n<p>My mom thinks Joe Biden is a great choice for president because of his connection to Obama. , “I’m sure he’s going to get a lot of advice on Obama. they’re very close, they’re still close.”  She’s still the same moderate Democrat she was in 2008, but I’ve strayed away from it. I was 19 years old when the Occupy Wall Street protests started. I went on YouTube to see why the protesters were there, camping out night after night, and I learned about income inequality and how the rich were getting richer. And I started to realize there’s a lot we don’t have control over, like our healthcare and how we pay for it, a problem I’ve seen over and over among my friends and family.  </p>\n<p>My sister Fadeline was in a car accident and even with health insurance wound up with medical debt. “I racked up over $20,000 worth of bills at the hospital I don’t know how,” she told me. And her copays are as high as $75. “It just makes it hard for me to want to go to the doctor sometimes until I'm like more financially better and ready to start going and doing all the appointments.”</p>\n<p>During Bernie Sanders’ run for president in 2016, I began to believe in a system where people could go to the doctor without worrying about drowning in medical debt. I started questioning what I’d accepted as normal. So, a year ago, I joined the Democratic Socialists of America.  And when Bernie was running in the primary we canvassed and phone banked for him. But four years later, it feels like 2016 all over again: President Trump versus another centrist Democrat.</p>\n<p>Some people in my DSA chapter are planning to vote for third party candidates come November, like Lebeau Kpadenou, our DSA co-chair. “I’m not voting for Joe Biden, I’m not voting for Donald Trump. If there weren’t someone running on the platform I believe in, I would not [vote] for president.” He plans to vote for the Green Party candidate Howie Hawkins. But many of us are planning to vote for Joe Biden. Milo Keogh is also a member of the DSA, “I think I’ll vote for Joe just because Trump is a dangerous guy, but I’m not in a place where I could convince people to vote for him or campaign for him at all.”</p>\n<p>I’ll also vote for Joe Biden but I still want more for the country. So I’m putting my political and organizing energy elsewhere, like fighting for a higher minimum wage in Florida. I’ve learned that politics is more than elections and voting every four years: it’s steering committee meetings, education roundtables and having difficult conversations. It’s not enough to just boot Trump out of office and go back to “normal.”</p>","audioWaveform":"WzAuNzA4LDAuODEsMC40NywwLjU5NiwwLjc2MSwwLjczOSwwLjMxMywwLjU3OCwwLjY2NCwwLjYyLDAuNzQ3LDAuNDkxLDAuNzA4LDAuNDEzLDAuNTE1LDAuNDYyLDAuNTY2LDAuNjM5LDAuNjM3LDAuNDczLDAuNDQzLDAuNDQ5LDAuNTg4LDAuNTQ2LDAuNTY4LDAuNDgzLDAuMjA0LDEsMC40MzEsMC43MDUsMC4yMTcsMC40NTYsMC45MTksMC41NzUsMC42MjQsMC40MjcsMC41NjYsMC45MTEsMC40NzIsMC41NDIsMC42ODIsMC40NjgsMC44NzEsMC41MzMsMC43NjgsMC42MzEsMC45MjEsMC42NSwwLjcxNSwwLjI0NCwwLjg0NSwwLjQyMiwwLjQ2MiwwLjI4MywwLjU0OCwwLjU5NiwwLjI0NywwLjM5MywwLjM3NSwwLjU5NCwwLjQ2NSwwLjMyNywwLjM5MSwwLjI5NCwwLjM0NiwwLjQwNiwwLjc2NiwwLjYxMywwLjUxMiwwLjUxNywwLjU2LDAuNTA4LDAuMzgyLDAuNTQ5LDAuMzgsMC41MSwwLjQyNCwwLjYzNCwwLjQ3MywwLjQ2NiwwLjQwMSwwLjM3MywwLjM4NSwwLjQ5OSwwLjU3NiwwLjY1OSwwLjI3NCwwLjUyOCwwLjQzMiwwLjcxNiwwLjUyNiwwLjYxNSwwLjQ2MywwLjUwMSwwLjQwNywwLjI2MiwwLjYxMiwwLjQwNywwLjQ2OSwwLjU1LDAuNTg3LDAuNTA3LDAuNDc5LDAuNTEsMC4zMTEsMC41NjMsMC40NTcsMC4zLDAuNDU2LDAuMzYyXQ==","slug":"to-move-forward-after-bernie-a-young-progressive-looks-to-the-past","authorslug":"sher-delva"},{"type":"story","feature":"false","format":"audio","location":"Baltimore, MD","audioURL":"https://www.podtrac.com/pts/redirect.mp3/audio.wnyc.org/radiorookies/radiorookies071320_madisonhall.mp3","title":"Expecting the Unexpected: Graduating High School During a Pandemic","author":"Madison Hall","date":"06/04/20","featureImage":"articles/madison_expecting-the-unexpected_feature-edit.jpg","featureImageSmall":"articles/madison_expecting-the-unexpected_feature-edit-small.jpg","featureImageCaption":"Madison Hall poses for a photo with five friends. The group planned a small party after their senior prom was canceled.","featureImageCredits":"Photo: Courtesy of Madison Hall","summary":"When a global pandemic canceled end-of-the-year milestones for the class of 2020, Madison Hall learned an important lesson about expectations.","text":"<p><b>Madison:</b> When schools first closed in March, they told us we’d be back in a couple of weeks. And when things got worse, we figured we’d be spending the rest of the year at home. But we kept hearing we might be able to go back. It was annoying — how the dates kept changing. In April, the state said schools would stay closed until the middle of May.</p>\n<p>[<b>Television news reporter:</b> With several developments today from Maryland, Delaware and Virginia. First in Maryland, the school closures in the state have been extended through May 15.]</p>\n<p><b>Madison:</b> I immediately told my brother Christian.</p>\n<p><b>Christian:</b> I feel like they’re gonna set the date and then they’re going to postpone it over and over again. </p>\n<p><b>Madison:</b> Yeah, no, they’re definitely going to do that. </p>\n<p><b>Christian:</b> Yeah. We’re not actually going back.</p>\n<p><b>Madison:</b> That’s how I feel.</p>\n<p><b>Madison:</b> Because you know what this means. Christian?</p>\n<p><b>Christian:</b> Yeah?</p>\n<p><b>Madison:</b> This means that I might have prom!</p>\n<p><b>Christian:</b> You might have prom?</p>\n<p><b>Madison:</b> We might have prom.</p>\n<p><b>Christian:</b> Oh, you’re a senior now!</p>\n<p><b>Madison:</b> Yeah, prom is May 23. So guys, I’m still going to have prom. Time to go get that prom dress! Glad they gave us that stimulus check!</p>\n<p><b>Madison:</b> I know I sound excited but even then, I didn’t really believe we’d have prom. And I never did get that prom dress — I just wanted something to feel hopeful about. My friends Shayla and Rayelle did too.</p>\n<p><b>Madison:</b> Did they officially postpone it? </p>\n<p><b>Shayla:</b> Mhm.</p>\n<p><b>Madison:</b> Wow.</p>\n<p><b>Rayelle:</b> Yeah, they sent out an email. The same email that they cancelled senior thingies and graduation. </p>\n<p><b>Madison:</b> Wow.</p>\n<p><b>Shayla:</b> I’m not too upset. </p>\n<p><b>Madison:</b> Really? Your dress, like, just came in the mail.</p>\n<p><b>Shayla:</b> I’m not too upset because at least it’s not cancelled. It’s just postponed. </p>\n<p><b>Madison:</b> I don’t know if you guys felt that but like yesterday, I don’t know why I was just in this state of, like — literally if we don’t have prom, it’s whatever. Like, I just couldn’t care less. I was so mad because, like, what have we actually had that was normal? What?</p>\n<p><b>Madison:</b> I think we all knew it wasn’t gonna happen. I was trying to convince myself I didn’t care. But my friends really wanted to do something.</p>\n<p><b>Madison:</b> You had a whole plan?</p>\n<p><b>Rayelle:</b> Yeah, if I heard that the prom was cancelled: The day I’m supposed to go to prom I’m wearing my dress, regardless where I am.</p>\n<p>[Madison laughs.]</p>\n<p><b>Rayelle:</b> Do the whole dress up. Hair, makeup, nails, everything. And I’m wearing the dress. I don’t care if I’m going grocery shopping.</p>\n<p><b>Shayla:</b> Go off. </p>\n<p><b>Madison:</b> So on the day our prom was scheduled for, my friends and I threw our own. </p>\n<p>[Madison greets friends.]</p>\n<p><b>Madison:</b> Hi</p>\n<p><b>Friend:</b> Oh my god, you look so pretty!</p>\n<p><b>Madison:</b> Thank you!</p>\n<p><b>Friend:</b> Go off, sis!</p>\n<p><b>Madison:</b> When I got to Shayla’s house I was really excited to see everyone. We hadn’t hung out in more than two months. </p>\n<p>[Madison and friends talk in background.]</p>\n<p><b>Friend:</b> Oh really? That’s so cute.</p>\n<p><b>Second friend:</b> You tie-dyed it?</p>\n<p><b>Madison:</b> I wore an old dress — that I had dyed sunset colors that morning — and we stood on Shayla’s driveway posing for pictures. Cars honked as they drove past. </p>\n<p>[Cars honk.]</p>\n<p><b>Madison:</b> I never thought this was how my senior year would look. </p>\n<p>[<b>Music plays:</b> High Hopes by Panic! At The Disco]</p>\n<p>Me and my  five friends dancing in someone’s basement on prom night. Or having my graduation in my living room in front of a computer screen. </p>\n<p>[<b>Music plays:</b> Pomp and Circumstance]</p>\n<p>[<b>Sound of virtual graduation:</b> Other students’ names are called. “Madison Hall” is called and her family cheers.]</p>\n<p>My high school was kind of chaotic, even before COVID. So I’ve gotten used to things changing a lot. Like I’m supposed to be starting college at NYU in the fall but I’m not making any plans yet. I’ve learned that no matter how much you expect the unexpected —  things can always get even more unexpected.</p>\n<p><i>Also featured on <a class=\"link blue underline underline-hover hover-dark-red\" href=\"https://www.wnyc.org\" rel=\"nofollow\" target=\"_blank\">WNYC</a> and <a class=\"link blue underline underline-hover hover-dark-red\" href=\"https://www.wypr.org\" rel=\"nofollow\" target=\"_blank\">WYPR</a>.</i></p>","audioWaveform":"WzAuNTU1LDAuNTI5LDAuNDc3LDAuNjQzLDAuNDMyLDAuNTAxLDAuNDQ5LDAuMzkzLDAuMzU0LDAuMzksMC42MDcsMC41NzYsMC4zNDIsMC4yODMsMC41MTQsMC4zNTIsMC40MywwLjI0NiwwLjUwNCwwLjM1MiwwLjQ1MiwwLjcyNSwwLjc3MiwwLjQ3OCwwLjgxNSwwLjU0MywwLjM2NSwwLjU0OSwwLjQ1LDAuNDg2LDAuMzgsMC4zNjksMC4yOTUsMC41NjksMC4zMTksMC41MzQsMC4zNywwLjQ2LDAuMjkyLDAuNDE0LDAuMjQsMC41ODcsMSwwLjE0NiwwLjMxOCwwLjMxOCwwLjM1NCwwLjc3MiwwLjQ3NSwwLjY5NiwwLjU1NCwwLjI3OSwwLjM1MywwLjQxNywwLjgyMywwLjI1NSwwLjM3NywwLjMyNywwLjU5NywwLjUwNywwLjUxLDAuMzcsMC42MTYsMC40NzIsMC41NTQsMC41MTQsMC4xOTYsMC41NDYsMC41NTYsMC41MTcsMC41NzgsMC4zNDMsMC4zNjUsMC41NzgsMC42MjQsMC4zODMsMC4yODMsMC42NDQsMC40NDMsMC40MjYsMC42MTIsMC41NDQsMC40ODksMC40NjIsMC4zMjcsMC40MDQsMC4zMywwLjUzMiwwLjU0NCwwLjE3NSwwLjU0NiwwLjU5NCwwLjM4NywwLjU1OCwwLjcwMywwLjUxLDAuNzEzLDAuODQ5LDAuNTExLDAuNzA0LDAuNDQxLDAuNDA1LDAuNjUyLDAuNDk2LDAuMzQxLDAuODExLDAuMjU2LDAuNjc2LDAuMTcxLDAuMTdd","slug":"expecting-the-unexpected-graduating-high-school-during-a-pandemic","authorslug":"madison-hall"},{"type":"story","feature":"false","format":"audio","location":"Wilmington, NC","audioURL":"https://www.podtrac.com/pts/redirect.mp3/audio.wnyc.org/radiorookies/radiorookies071320_laurabratton.mp3","title":"Young and Sober During COVID-19","author":"Laura Bratton","date":"07/13/2020","featureImage":"articles/18to29Now_RR_YR_LauraBratton.jpg","featureImageSmall":"articles/18to29Now_RR_YR_LauraBratton-small.jpg","featureImageCredits":"Photo: Courtesy of Laura Bratton","featureImageCaption":"Laura Bratton, who has been sober for two and a half years, sits on the beach reading a book as she waits for a 12-step meeting to start in Wilmington, North Carolina.","summary":"When you're in recovery, staying sober is difficult under the best of circumstances and COVID-19 is pretty much the worst. Laura Bratton has watched her recovery community struggle through the last four months.","text":"<p><b>Laura:</b> Zoom meetings were all we had for three months during shelter in place. And at first, I was excited to try recovery online.</p>\n<p>[<b>Laura:</b> Join without video]</p>\n<p><b>Laura:</b> Going to 12-step meetings in different parts of the world and hearing people’s stories while I’m eating dinner in my pajamas.</p>\n<p><b>Felicia:</b> Like in the beginning. I just want to get super spiritual.  </p>\n<p><b>Laura:</b> Felicia is a friend from my 12-step home group. </p>\n<p><b>Felicia:</b> You fast-forward like three weeks and I’m just sitting in my house doing puzzles.</p>\n<p><b>Laura:</b> I get it. Before COVID, I used to go to three or four 12-step meetings every week. But after a few weeks online, I went down to one. Other people started dropping off too. I figured some people just couldn’t adjust to getting their recovery on a computer screen. I helped Jim, a regular at my home group, figure out how to log onto a Zoom meeting — but he didn’t love it. </p>\n<p><b>Jim:</b> They’re just things you miss. The look in people’s eyes. The smiles on their faces.  </p>\n<p><b>Laura:</b>  I wondered if some people were slipping through the cracks. Had they relapsed? Were they okay? Like this one guy I know, Robert. I’ve known him for years. He’s in a court-ordered treatment program. And he was a regular in my home group before the pandemic started. Then a few weeks into shelter in place, I noticed he’d relapsed. He was starting over, counting sober days rather than months. I called him back in April to find out what happened. </p>\n<p><b>Robert:</b> I was riding my bike around town like nothing was open and there were no meetings going on. And I was really, really contemplating getting high. </p>\n<p><b>Laura:</b> Robert told me that almost all of his support systems shut down — court mandated therapy programs and drug tests that made him feel accountable. </p>\n<p><b>Robert:</b>  I didn’t want to blame my relapse on COVID-19 and I’m not going to. But I did think about it and, like, it gave me such a — it was such a big factor to like me starting to isolate again. I still had those people there. But not being able to physically be with them or see their smiles in person or feel their energy just took a lot from me I think.  </p>\n<p><b>Laura:</b> Why do you think those things are so important for you getting sober?  </p>\n<p><b>Robert:</b> Cause, I mean, I’m an addict, an alcoholic. But like at the end of the day, I’m a f-ing human. </p>\n<p><b>Laura:</b> That was April 16, one month into shelter in place. I didn’t see Robert in online meetings for the next week, and I worried what would happen to him. Right around that time, I also found out that a few people I knew from my early days in sobriety had overdosed and died. Weeks went by and I still didn’t see Robert. Then in May, a friend told me she’d seen his mugshot online. It turns out he’d gotten arrested. Right after he got out, I called him to see what happened.</p>\n<p><b>Robert:</b> Hey, what’s up? </p>\n<p><b>Laura:</b> How ya doin? </p>\n<p><b>Robert:</b> I’m alright. </p>\n<p><b>Laura:</b> He said the day after we’d talked, he’d gotten high again and called his probation officer. I asked him what went on during those three weeks he was in jail.</p>\n<p><b>Robert:</b> You’re locked in a cell for 23 hours a day, that’s their form of quarantine. That makes COVID like kind of seem easy. Like, I remember being out on rec one day and I saw this, I think it was like — what’s the insurance company that Flo works for? Progressive?</p>\n<p><b>Laura:</b> Progressive?</p>\n<p><b>Robert:</b> They had like some commercial where they were like all on like a Zoom meeting. And like, I looked at it and I was just like, you know, like I could be in a Zoom meeting right now.  </p>\n<p><b>Laura:</b> Robert’s been out of jail for more than a month. I’ve seen him in Zoom meetings, and I got a call from him a few weeks ago asking to join my home group. As a group, we’ve been waiting for months until we can all be together in person and finally, when phase two started, we made plans to meet on the beach.</p>\n<p>[<b>Laura:</b> I’m headed to my first home group meeting I've been to in person since COVID started. Yeah. I don't know what this is gonna be like at all.]</p>\n<p>[<b>Laura:</b> So I’m on my way back from the home group. I don’t know how I feel about it. Like, no one was wearing masks and I mean, people were kind of sitting six feet apart. But it feels like we were closer than that. It was like not a lot of people from my home group were there. I would say only me and two other people and then a bunch of people I just didn’t recognize. It definitely felt pretty of sparse. I’m actually passing the church where we usually have our home group right now — I don’t think they’ve been in that church for a long time. I definitely miss that place.]  </p>\n<p><b>Laura:</b> Here we are, phase two.  My home group stopped doing Zoom and we’re trying to figure out what’s next. Cases in Wilmington have started rising, and things feel unsafe and uncertain. People in recovery are used to marking time. In the early days after I quit drinking, I remember waiting to hit those markers: The first 60 days, 90 days. As though something will be different, as though being sober won’t be quite as much work. Just like with COVID: we want the work to be over and we want things to go back to some kind of normal.</p>\n<p><i>Also featured on NPR's <a class=\"link blue underline underline-hover hover-dark-red\" href=\"https://www.npr.org/programs/all-things-considered\" rel=\"nofollow\" target=\"_blank\">All Things Considered</a>. </i></p>","audioWaveform":"WzAuNjQ5LDAuNDgzLDAuNzkzLDAuNDQzLDAuNzE2LDAuNzMzLDAuNjQzLDAuNjY3LDAuNjksMC40NDQsMC44NDMsMSwwLjQ2LDAuNDQ1LDAuNTM0LDAuNDM4LDAuNzY0LDAuNTM4LDAuNTAxLDAuNjA0LDAuNDA1LDAuMzU2LDAuNjEyLDAuNjUsMC41MTEsMC42MDYsMC40MzYsMC41MzksMC42MTIsMC40ODgsMC40NzUsMC41NzUsMC40NzEsMC41NTYsMC41NTUsMC42MDMsMC40ODQsMC4yNywwLjI3MSwwLjQ1NSwwLjUxLDAuNDA1LDAuMjUzLDAuMjgyLDAuNDY5LDAuNDc5LDAuMzUxLDAuNTQsMC41MzEsMC41MDYsMC42MzYsMC40MDQsMC41NTcsMC41NjQsMC41MDMsMC40MTEsMC4zNiwwLjQwOCwwLjUyLDAuNTY0LDAuNDI5LDAuNTI2LDAuNTkyLDAuNDksMC40NDUsMC40MDUsMC41MzIsMC42MzQsMC42MjMsMC42MDEsMC41MDksMC41LDAuNzIzLDAuNTI4LDAuNzYzLDAuNzAzLDAuNjM4LDAuODczLDAuNjk2LDAuNzA3LDAuNjI0LDAuNDk4LDAuMDk0LDAuNTA5LDAuNjE1LDAuNjM4LDAuOTUsMC42MDMsMC41NzcsMC42MjIsMC43OTEsMC45MjcsMC43MiwwLjcxMiwwLjQxNCwwLjg5MSwwLjY0NCwwLjY2OCwwLjQ5MywwLjcyMSwwLjYyMSwwLjY2MywwLjUzNCwwLjc5LDAuODc2LDAuNjIzLDAuNjM0LDAuMzczLDAuNTMzLDAuNDc4XQ==","slug":"young-and-sober-during-covid-19","authorslug":"laura-bratton"},{"type":"story","feature":"true","format":"text","location":"El Paso, TX","title":"“I Am in Juárez. You Are in El Paso.” Pandemic Reflections From Borderland","author":"Antonio Villaseñor-Baca","date":"07/13/20","featureImage":"articles/antonio_pandemic-reflections_feature-edit.jpg","featureImageSmall":"articles/antonio_pandemic-reflections_feature-edit-small.jpg","featureImageCaption":"Grecia Sánchez Blanco is a recent graduate of the University of Texas at El Paso.","featureImageCredits":"Photo: Claudia Hernández","summary":"A conversation with Grecia Sánchez Blanco, a student who used to cross the U.S.-Mexico border daily for school.","text":"<p>Coronavirus has shut down everyday life around the globe, but for borderlanders like my friend Grecia Sánchez Blanco, the quarantine has meant more than just a delayed graduation ceremony and working from home. </p>\n<p>Grecia lives in Ciudad Juárez, Mexico and just completed her last semester at the University of Texas at El Paso (U.T.E.P.), double-majoring in philosophy and multimedia journalism. Before all this, she’d cross the border every single day. Then President Trump <a class=\"link blue underline underline-hover hover-dark-red\" href=\"https://www.texastribune.org/2020/03/20/covid-19-leads-trump-announce-partial-closure-southern-border/\" rel=\"nofollow\" target=\"_blank\">closed</a> the U.S.-Mexico border to non-essential workers back in March and <a class=\"link blue underline underline-hover hover-dark-red\" href=\"https://www.nytimes.com/2020/05/13/us/politics/trump-coronavirus-border-restrictions.html\" rel=\"nofollow\" target=\"_blank\">extended</a> those restrictions “indefinitely” as of May. </p>\n<p>So even though students with the right papers can convince border agents to let them through — the process is a whole lot more uncertain now. Grecia hasn’t even tried to cross. So she’s had to forfeit her final days on campus, her community in the newsrooms of the <a class=\"link blue underline underline-hover hover-dark-red\" href=\"https://borderzine.com/\" rel=\"nofollow\" target=\"_blank\">magazines</a> she edits, the research she’d been doing for her philosophy class at a high school that’s now closed. </p>\n<p>The quarantine also brought about uncertainty about the future: whether her graduate program that starts this fall would actually happen. So far it looks like her courses will all be online. </p>\n<p>These types of disappointments and anxieties are commonplace for students living through the pandemic. And the border shutdown we’re experiencing has been looming as a threat since long before coronavirus. What’s different for Grecia is that she feels cut off from an entire country she used to come to each day. </p>\n<p>Even though I’m living through the lockdown too, as a U.S. student, my experience is so different from my friend’s. I wanted to find out from Grecia how the mostly-closed border has affected her life. We started by remembering her last day on campus. </p>\n<p>This interview was edited for length and clarity. </p>\n<p><b>Grecia Sánchez Blanco:</b> I still remember my last day at U.T.E.P.. I had a regular work schedule from 9 to 2 p.m. And then after that I had lunch. And then I went to do an interview for my philosophy project. And then after I finished my interview, I found out that the president of U.T.E.P. said we were going to have an extra week for spring break, and that the rest of the classes for the semester were going to be remote delivery. </p>\n<p>I didn't want to leave. I realized that was going to be my last day as a senior, as an international student. I'm walking between those buildings, just experiencing nature from that day because that's something I really like to do. I really liked — in past tense — to do, on a daily basis. </p>\n<p><b>Antonio Villaseñor-Baca: What has that time you lost meant to you? What runs through your mind, knowing that you don’t have that anymore?</b></p>\n<p><b>GSB:</b> The way I wanted to remember U.T.E.P. was taken from me, from one day to the next. I wanted to take photos in my cap and gown on the U.T.E.P. grounds, before my graduation, and that’s not going to happen anymore. That’s like a ritual for U.T.E.P. students. </p>\n<p>It has been strange. It has been frustrating. I have cried a lot, just because of what all this means. </p>\n<p>The reality is also this: I am in Juárez. And you are in El Paso. We won’t even be able to visit each other from one house to the next and the border is closed. </p>\n<p><b><i>I wanted to know if Grecia remembered a specific moment when her experience of the quarantine was different from classmates like me, who live in El Paso. She told me about a class on French films. Before quarantine, students watched films from the professor’s Amazon account. After the campus closed, they couldn’t do that anymore. </i></b></p>\n<p><b>GSB:</b> With the virus, he emailed us saying: you have two options. Tell me if you want to focus on the films and you’d have to buy the films on Amazon, or we can focus on grammar. </p>\n<p>My family earns in Mexican pesos. I earn in Mexican pesos. Both jobs I have on campus at U.T.E.P. pay me at the end of the semester, which means I don’t have U.S. dollars right now. And I told the professor, it will be really, really appreciated if you could consider my special situation as a Mexican student whose family earns in Mexican pesos, who can no longer pay for that amount in films. Right now, my expenses are allocated to only pay groceries and meals. Those are my essential expenses. I cannot afford to pay more than that. </p>\n<p>Since the virus came to paralyze the whole world, the difference between the peso and the dollar has risen significantly. The peso [is] depreciating and that deeply affects the families that earn in Mexican pesos. Including mine.  That’s basically what I told the professor. </p>\n<p>He talked to his Chair, and they were able to buy me an Amazon subscription for the rest of the semester. It’s something I appreciate so much. It shows that even under these circumstances, there are people that worry about the well-being of other people and that understand that everybody has different circumstances. Those are the things that are at the top of my mind.  </p>\n<p><b>AVB: There have been threats previously from this current U.S. administration to shut down the border. Like had you worried about this prior to [the pandemic]?</b></p>\n<p>Totally. Now I remember, it’s been two years, Trump gave the order to remove people from the bridges and remove to the processing centers, the immigrants because that “wave” of immigrants was coming. I’m talking about when there was this threat of closing this border. All of us that were crossing the border, we had to carry a change of clothes in case we got stuck on the other side. Having to pack your suitcase, for if you get stuck over here or over there. And having to notify your professors who would tell me, if you’re not here, you can’t take my class. And I have had to fight for my place in a lot of ways at U.T.E.P.. </p>\n<p><b>What did those experiences mean to you — the fact that you had to pack your bags and just be ready in case the border did get shut down? Like, that's not a normal thing that students have to worry about. </b></p>\n<p>I think it makes you prepared for the unexpected in the best possible way, It has made me embrace uncertainty, whether I want it or not. And it has made me worry about everything. I try to manage. I have a lot of, you know me, llevo un chingo de garabatos. But that's because things are always changing when you're crossing the border. My experience of the border has made me more aware of how everything can suddenly change.</p>\n<p><b>How do the U.S. elections impact you? Why does it matter to you? How does the rhetoric impact you?</b></p>\n<p>I have had harder times to cross whenever President Trump gives a speech that resonates a lot with his constituents. It gets harder for me to cross to study. I get asked more questions. I get inspected more often. I get harassed more often too, and harassment in the way of comments that tend to be hurtful. As a woman and as a philosophy major. And like I said before, I have had to fight for my place at certain classes where professors don't understand that I may be late to a class or that I may not be able to come at all, because I got inspected at the bridge. and those inspections tend to last from half an hour to two hours. It's a really long time for a student when you’re in that line and you're crossing with, ósea aún si te estás llendo de tu casa una hora antes, si te atrasas 15 minutos por el tráfico because of the bridge lines, because of the questions that agents ask. </p>\n<p><b>And just as a follow up question to that, because I feel like it very unfortunately does have to be asked in this political climate: What do you say to people who would say that that's justified? That this isn't your country? That it's in the name of national security? What do you say to those people?</b></p>\n<p>I would invite them to think about their life right now, and how the virus has impacted their life personally. Because chances are, their experience is going to be very similar to the immigrant experience in the sense that, something that is outside of your control happens, and you react the best way that you can for you, for your family, for your loved ones. I would ask them to question themselves. Because they don't seem to question themselves about what they would do if their whole life would be like they're living now.</p>","slug":"i-am-in-juarez-you-are-in-el-paso-pandemic-reflections-from-borderland","authorslug":"antonio-villasenor-baca"},{"type":"story","feature":"false","format":"audio","location":"New York City, NY.","audioURL":"https://www.podtrac.com/pts/redirect.mp3/audio.wnyc.org/radiorookies/radiorookies090820_madison1829final.mp3","title":"From Quarantine to Class at NYU, a Freshman Starts Her Next Chapter","author":"Madison Hall","date":"09/04/20","featureImage":"articles/MadisonHall_RadioRookies_NYU_02_2000px.jpg","featureImageSmall":"articles/MadisonHall_RadioRookies_NYU_02_small.jpg","featureImageCaption":"Madison Hall poses for a self-portrait while in quarantine inside her NYU dorm room.","featureImageCredits":"Photo: Courtesy of Madison Hall","summary":"Madison Hall’s college experience started with a two-week quarantine in her dorm room. As classes begin, she reflects on the difficult decision to move away from home during an ongoing pandemic.","text":"<p><b>Madison:</b> Back in early July, NYU gave me four weeks to decide if I wanted to live on campus or take classes remotely from home. Having to make a decision was frustrating.</p>\n<p><b>Madison:</b> [Audio diary] I’m very much struggling with trying to decide what I’m supposed to be feeling. Like, I’m confused about a lot of things but I’m not sure, like, if I’m allowed to be confused about it. Like, am I confused because I’m a freshman in college or am I confused because the world is in a confusing place right now?</p>\n<p><b>Madison:</b> I usually try not to make decisions based on my emotions but the pandemic made it hard to think clearly. I didn’t talk to my parents about my decision — I knew they’d want me to stay. And I didn’t wanna get their hopes up. I also knew they might actually convince me to stay. So I talked to my older sister about it. She said I would regret not dorming. I would miss out on a big part of my college experience. And if I stayed, there would be seven of us in the house. That gave me the reasons I needed to go. I knew I should leave home, even though I didn’t really want to.</p>\n<p><b>Madison:</b> [On a Zoom call] Hi, how’s it going?</p>\n<p><b>Andrea:</b> Alright.</p>\n<p><b>Madison:</b> My friends were also deciding what to do. We talked about how school might look in the fall.</p>\n<p><b>Andrea:</b>  [On Zoom] I feel like I won’t grow as much this year as I would if the year was normal. I feel like my personal development will be stunted.</p>\n<p><b>Madison:</b> That’s my friend Andrea. She decided to take her classes from home.</p>\n<p><b>Andrea:</b> [On Zoom] I won’t get the experience being, like, more independent because I’m staying at home.</p>\n<p><b>Madison:</b> Our friend Rayelle was also on Zoom with us. We had both decided to dorm on campus. </p>\n<p><b>Madison:</b> [On Zoom] So how do you feel about, like, the fact that your freshman year isn’t going to be, like, normal? </p>\n<p><b>Rayelle:</b> Kind of disappointed because everyone’s been talking up college. You know, I’ve watched a lot of movies — everyone’s like college is the time you get to let go, go crazy, learn about yourself and everything. But nope, we all get to be quarantined and wear masks.</p>\n<p><b>Madison:</b> Find yourself inside of a mask. It’s Gucci.</p>\n<p><b>Madison:</b> I do wonder how I’m gonna make friends. I’ve never really been a fan of making friends online. It’s just not the same as talking in person. As far as classes go — I don’t mind the social distancing. </p>\n<p><b>Madison:</b> I’m actually looking a lot — like I’m very looking forward to being six feet apart. I don’t know. I’m antisocial and I don’t like talking to people in class. I hope this means no group projects, that’s what I want. No group projects. [Laughs] </p>\n<p>[Zoom call ends]</p>\n<p><b>Madison:</b> We were worried about a lot of things — the whole transition to college: Classes, how to make friends, moving. I didn’t spend much time thinking about the possibility of getting COVID. Until I got an email from NYU saying that I had to move in two weeks early to quarantine. When I told my parents that, it made everything feel more real for them.</p>\n<p><b>Madison’s mom:</b> What is the exit plan if there is a second wave of this virus and more people are getting sick and they begin to shut things down again? Cause I don't even think they should have opened the school back up. Like — Manhattan is deserted.</p>\n<p><b>Madison:</b> I try not to think about what will happen if NYU shuts down. </p>\n<p><b>Madison’s sister:</b> They’re not gonna make it so that students can’t get home.</p>\n<p><b>Mom:</b> But they might if they say shelter in place. </p>\n<p><b>Madison:</b> But then I'll have to quarantine — right. Then I have to quarantine in my dorm and it’s not even a question.</p>\n<p><b>Madison’s mom:</b> But are they gonna have food set up? If they’re sending all the workers home, how you eating? You see what I'm saying? </p>\n<p><b>Madison:</b> They’re not gonna let me starve if I have to shelter in place.</p>\n<p><b>Mom:</b> They might not have a choice!</p>\n<p><b>Madison:</b> In March, my sister was studying abroad and got stuck in Europe. So now my mom tries to prepare for the worst. </p>\n<p><b>Madison:</b> But if I have to shelter — they’re not gonna let me starve. Like you guys can ship me — I’ll order me food if it’s that serious.</p>\n<p><b>Mom:</b> I’m just saying you’ve got to be prepared for anything. </p>\n<p><b>Madison:</b> I understood why she was worrying but some of her fears weren’t realistic. I felt like NYU was gonna do their best. And I was starting to get excited about going to college. On August 18th, I woke up early and we drove to New York.</p>\n<p><b>Madison:</b> [In background] I really just wanna — I’m already late for my move-in appointment.</p>\n<p><b>Madison:</b> The last few miles, I was really anxious and my stomach was in knots. When we got there, there was a really long line to get tested for COVID.</p>\n<p><b>Madison’s dad:</b> [In background] We out here! In this COVID-19 line, baby!</p>\n<p><b>Madison:</b> I was told it would hurt, but it didn’t.</p>\n<p><b>Madison:</b> [Right after getting tested] My nose feels clean though. </p>\n<p><b>Madison:</b> After that, I checked in at my dorm.</p>\n<p><b>Madison’s mom:</b> [In background] I’m so excited for you, Madison! </p>\n<p><b>Madison:</b> I got a welcome package that had my ID and key. But also a bunch of masks, hand sanitizer and a thermometer. </p>\n<p><b>Staffer checking people in:</b> So I just need your signature there as well as your phone number.</p>\n<p><b>Madison:</b> My dad, mom and aunt all took turns coming upstairs. We carried stuff in then cleaned and rearranged the room. And then I was all alone.</p>\n<p>[Sound of door shutting]</p>\n<p><b>Madison:</b> [Audio diary from move-in day] Oh my gosh. I am alone. Everyone is gone, it is just me, my food and my bed.</p>\n<p><b>Madison:</b> I spent my days watching Netflix and talking to my high school friends. </p>\n<p><b>Madison’s friends:</b> [On a call] So how’s the dorm? Is it a nice dorm? </p>\n<p><b>Madison:</b> Two of them were also in quarantine. </p>\n<p><b>Rayelle:</b> [On phone] Wait, how do you get your food? Do you have to go get it or do they bring it to you? </p>\n<p><b>Madison:</b> Once a day someone rattles my doorknob like a serial killer. [Laughs] And then I wait five minutes so I won’t be murdered in a very empty hallway. And then I open the door and there's a brown paper bag on the doorknob. </p>\n<p><b>Madison:</b> Mostly, though, I just ate Pop-Tarts and ramen. And was really bored.</p>\n<p><b>Madison:</b> [On a call with friends] Should I ship you some of my ramen? [Laughter]</p>\n<p><b>Madison:</b> The day quarantine ended, I wanted to go outside but I didn’t wanna go alone. So I sent a message to one of the group chats I’m in and asked if anyone wanted to meet up. There were more responses than I expected — we had to split up just so we could social distance properly. But we still had fun walking around until it got dark. The next day, I went to my first classes on Zoom. Even if things shut down tomorrow, I’d be glad I decided to come to NYU. COVID took my senior year of high school but it didn’t stop me from moving into my dorm and making new friends.</p>\n<p><i>Also featured on <a class=\"link blue underline underline-hover hover-dark-red\" href=\"https://www.wnyc.org\" rel=\"nofollow\" target=\"_blank\">WNYC</a> and on NPR/WBUR’s <a class=\"link blue underline underline-hover hover-dark-red\" href=\"https://www.wbur.org/hereandnow\" rel=\"nofollow\" target=\"_blank\">Here and Now</a>.</i></p>","audioWaveform":"WzAuNTgsMC40ODIsMC40MDEsMC4zOSwwLjQ2OSwwLjM1MSwwLjU4MiwwLjM3NywwLjUyNCwwLjQzLDAuNTI5LDAuMzY5LDAuMzk0LDAuNDI5LDAuNTA4LDAuNDQyLDAuMzgsMC41NDcsMC41MzgsMC40NTcsMC40ODUsMC41MywwLjU2OCwwLjQxMSwwLjczNSwwLjYwNCwwLjYyNCwwLjQ3MSwwLjMyOSwwLjUwNSwwLjMwOSwwLjU4NiwwLjU4OCwwLjM5OSwwLjI3MSwwLjQ5NSwwLjYzOCwwLjYzMSwwLjY2MywwLjY5NywwLjQ3MiwwLjU2MSwwLjQ3OCwwLjY1NywwLjQzLDAuNTYzLDAuNDExLDAuMzkyLDAuNTQ0LDAuNjQxLDAuNTE2LDAuNDE3LDAuNDU3LDAuMzgxLDAuMjUzLDAuNjc0LDAuNzYsMC41MDYsMC42ODUsMC43MjIsMC41MjIsMC4zNzksMC40NTUsMC41NywwLjU1NiwwLjY1LDAuODExLDAuNzUxLDAuODU4LDAuNzQ4LDAuOTM4LDAuODM4LDAuNTMyLDAuNjI1LDAuNDQ4LDAuODU0LDAuNTc0LDAuMjYzLDAuNTgsMC40OCwwLjM1NSwwLjQzLDAuMTU2LDAuMzgzLDAuNTkxLDAuNTM0LDAuNTU1LDAuNDk0LDAuNjQsMC42MzIsMC41MTEsMC4zNzQsMC43MzcsMC4yODUsMC43MTEsMC42LDAuNjY0LDAuNDQ4LDAuMjcyLDAuMzM5LDAuNTUyLDAuNjYzLDAuNTkxLDAuNTU2LDAuNjY5LDAuNTgyLDAuNzc0LDAuODEyLDEsMC4yNzZd","slug":"from-quarantine-to-class-at-nyu-a-freshman-starts-her-next-chapter","authorslug":"madison-hall"},{"type":"story","feature":"false","format":"audio","location":"Everett, WA","audioURL":"https://www.podtrac.com/pts/redirect.mp3/audio.wnyc.org/radiorookies/radiorookies100720_suryahendry.mp3","title":"Beyond Boeing: My Town, My Peers, Our Future","author":"Surya Hendry","date":"10/19/20","featureImage":"articles/surya_beyond-boeing.jpg","featureImageSmall":"articles/surya_beyond-boeing-small.jpg","featureImageCaption":"Boeing 787 Dreamliners sit on the assembly line at the Boeing Factory in Everett, Washington.","featureImageCredits":"Photo: Stephen Brashear/Getty Images","summary":"Surya Hendry grew up in Everett, home of Boeing and good manufacturing jobs. She’s been thinking about the political narrative of places like her hometown, and what the future looks like for her and her peers.","text":"<p>It was late August 2016, I was waiting for my junior year to start and then-Republican presidential candidate Donald Trump came to my city, Everett. “In this new future, millions of workers on the sidelines will be returned to the workforce,” Trump said in his speech. </p>\n<p>I get why a politician would like to tell our story. Everett is a company town — a poster child for manufacturing where you could graduate high school, get a job at Boeing and buy a house. But now that “middle class life” thing that people point to feels like it’s slipping away. </p>\n<p>For me and my peers, the story of Everett is also our story. And our fortunes are tied to the city’s. </p>\n<p>I’ve been thinking about the political narrative of places like my hometown, and how that may not hold for the future.</p>\n<p>Recently I went downtown to meet up with my friend Kelsey Fassett. We went to elementary and middle school together. The neighborhood where Kelsey grew up is full of families with parents who worked for Boeing. The neat 2-story houses probably look to an outsider like the typical “American dream.”</p>\n<p>“That was the blueprint for a lot of people our parents’ age,” she said. </p>\n<p>People are proud of this heritage of blue-collar success that Trump jumped on. But Kelsey is quick to point out that she’s on a different path. She goes to a state college and is a computer science major. She’s excited to work a tech job in the future — something with a lot of spreadsheets. “I am not like most people. The idea of sitting and crunching numbers all day sounds like a dream to me. That sounds awesome. I just love sitting and doing calculations and busy work. I love it,” she said.</p>\n<p>We talked about how even ten years ago, that decision to work in computer science would have been really rare, but now many kids in the area are leaving to take on Seattle jobs. Manufacturing doesn’t pay the bills the way it used to, and it’s not as stable anymore.</p>\n<p>I’ve lived here all my life. When my parents were searching for a place to raise a family, they chose Everett partially because it was affordable and safe for kids, according to my mom Shobhna Hendry. </p>\n<p>“We were looking for a home that would have a backyard and be spacious plus in a good school district,” she said. “We know many families that have stayed here for generations. But that wasn’t something we were expecting — that you and your sister would be here.” </p>\n<div class=\"mw5 center f7 gray\"><img loading=\"lazy\" class=\"db lazyload\" src=\"articles/SuryaHendry_AmeliaEarhartPic-crop.jpg\">\nReporter Surya Hendry in her childhood, dressed up as aviation pioneer Amelia Earhart. (Photo courtesy of Surya Hendry)</div>\n\n<p>Now, my mom wants me to explore the world. As a first-generation American, my mom had big dreams for our family. Other parents want their kids to follow in their footsteps — work for Boeing. Stay in Everett. Build a family here.</p>\n<p>Charlie Aust graduated high school in 2017, and has worked at Boeing for almost two years. His stepfather did maintenance as a subcontractor for Boeing.</p>\n<p>“I am what’s called an assembler installer. I work on the 767 planes,” he said. “I don't feel like I belong in this industry necessarily. It's mostly an opportunity thing because, you know, the job pays well and Boeing obviously, as a very large corporation, is going to offer a healthy benefits package, right? It's a good decision objectively for a lot of people in the area.”</p>\n<p>Charlie says people who were hired right after him are getting laid off, and he worries about getting laid off too. In the spring, Boeing announced a planned <a class=\"link blue underline underline-hover hover-dark-red\" href=\"https://boeing.mediaroom.com/news-releases-statements?item=130673\" rel=\"nofollow\" target=\"_blank\">10% reduction</a> in its workforce. More cuts are expected, and headlines about the <a class=\"link blue underline underline-hover hover-dark-red\" href=\"https://www.wsj.com/articles/boeing-to-move-all-787-dreamliner-production-to-south-carolina-11601425533?mod=hp_lead_pos3\" rel=\"nofollow\" target=\"_blank\">787 Dreamliner production</a> leaving Everett have everyone talking.</p>\n<p>When Boeing takes a hit, it threatens the way of life here. So, recently, I asked my mom a really big question: <i>What do you think would happen in this area if Boeing left Everett?</i></p>\n<p>Her response: “I think that Everett would see a larger depression in the economy than they’re already seeing, partly due to the pandemic.”</p>\n<p>We’re both invested in what happens to Boeing, even though my parents don’t work there and I went to college more than 800 miles away. “Yeah, because at the end of the day, we’re interconnected,” my mom said. We like our neighborhood, which is filled with young families who might not be able to keep their houses during a recession. And my dad’s legal business relies on Boeing employees having some expendable income. </p>\n<p>I decided to talk to my local representative, Democrat Jared Mead, about the future of Everett as a company town. He’s 29 years old, and he represents the experiences of my generation.</p>\n<p>“I lived with my mom until I was in my early 20s until I graduated college because that’s just what our generation is used to,” he told me when I asked him about how our prospects compare to earlier generations. “I had a long conversation with [my mom] just a few weeks ago about this exact thing. Most people have not had to deal with what our generation is now dealing with with the cost of living, the four-year degree price, the student loan debt interest. All of that. There’s a romanticized version of what a big corporation can do for a family,” Mead said.</p>\n<p>Mead said now most people here in their early 20s can’t buy a house. He couldn’t afford to buy a house in the area where he grew up. His father-in-law was a Boeing “lifer” who got a taste of the classic middle-class lifestyle. “He’s now in his early fifties. He’s been there 35, 36 years. And he lives in the house that he bought with his first two years of Boeing paychecks,” he said.</p>\n<p>To me, this almost sounds imaginary. Many of my friends are leaving because they can make more money elsewhere. Or they feel like Charlie Aust does, that manufacturing might not offer the kind of career they want long-term. “So it's kind of something I wrestle with myself about whether I want to stay at this job that I don't exactly love, you know, and get the you know, the money that they are willing to pay their people or, you know, take that loss financially and go somewhere else where I might enjoy it more,” he said.</p>\n<p>Young people like me have big decisions to make about whether to stay in our town or leave. And COVID and the economic recession aren’t making things any clearer. I just hope that my peers have the choice to stay here in Everett and build a successful future. </p>\n<p><i>Also featured on NPR/WBUR’s <a class=\"link blue underline underline-hover hover-dark-red\" href=\"https://www.wbur.org/hereandnow\" rel=\"nofollow\" target=\"_blank\">Here and Now</a>.</i></p>","audioWaveform":"WzAuNTQ3LDAuNTExLDAuMzU5LDAuMTUsMC4xOTQsMC4xOTgsMC4yMzYsMC4zMTUsMC4zMzIsMC4zNjIsMC41NzksMC4zODksMC41MTQsMC4zNDcsMC40NTksMC42MzYsMC41MiwwLjI1MSwwLjQ5NSwwLjUzNSwwLjU0LDAuMzA0LDAuMzU4LDAuNDI3LDAuMzIsMC4zMTEsMC4zMTEsMC4yNzcsMC40NjQsMC4zNiwwLjQyNywwLjE3OSwwLjU2OCwwLjQ3MSwwLjY0MywwLjQxNywwLjI5MywwLjUwNCwwLjQ3OSwwLjM1NiwwLjU5OCwwLjcxMywwLjU3OCwwLjM0NywxLDAuNjk4LDAuNTg1LDAuNDkzLDAuNTI5LDAuMzg5LDAuNDE3LDAuMjU3LDAuMzE2LDAuMzgyLDAuNDM3LDAuMzc1LDAuNDEsMC4zMTQsMC4yNSwwLjMxMSwwLjM1NywwLjI4OSwwLjI3OSwwLjQzNCwwLjMwMSwwLjUyMiwwLjM3NSwwLjQ2OSwwLjM2NiwwLjUxNSwwLjMyMiwwLjQ1NCwwLjQyNiwwLjM4MywwLjUzNywwLjE2MSwwLjU3NSwwLjU4NSwwLjY3MiwwLjU1OCwwLjc2MywwLjg4MiwwLjUzOSwwLjI0MywwLjc1OCwwLjgwNSwwLjUwOSwwLjU2OCwwLjU1MiwwLjYwOCwwLjQxOSwwLjQzMSwwLjM1NywwLjc4LDAuNTM1LDAuNjc0LDAuNDYzLDAuNTE5LDAuNDY3LDAuNjYzLDAuODI2LDAuNzQxLDAuNzg5LDAuNjg1LDAuNzAyLDAuNTQ1LDAuNjU2LDAuNDE4LDAuNDYyLDAuNDA4XQ==","slug":"beyond-boeing-my-town-my-peers-our-future","authorslug":"surya-hendry"},{"type":"story","feature":"false","format":"audio","location":"Savannah, GA","audioURL":"https://www.podtrac.com/pts/redirect.mp3/audio.wnyc.org/radiorookies/radiorookies101320_youngrepublican.mp3","title":"Hey GOP! Younger Gen Wants In","author":"William Carter","date":"10/15/20","featureImage":"articles/GettyImages-1156190019-edit.jpg","featureImageSmall":"articles/GettyImages-1156190019-edit-small.jpg","featureImageCaption":"Young supporters of the US president attend a \"Make America Great Again\" rally at Minges Coliseum in Greenville, North Carolina, on July 17, 2019.","featureImageCredits":"Photo: NICHOLAS KAMM/AFP via Getty Images","summary":"William Carter has been involved in politics since he was young, and he’s trying to find his way as a young Republican. It’s not that easy.","text":"<p>Ever since I was a child, I was always into politics. I wasn’t like normal kids who were interested in Pokemon. Seriously, when I was five, I had a G-8 birthday party. </p>\n<div class=\"mw5 pa3 fr cb center f7 gray\"><video controlslist=\"nodownload nofullscreen noremoteplayback\" src=\"articles/KatieCouricAndWill.mp4\" playsinline=\"\" controls=\"false\" class=\"db w-100\"></video>\nWilliam Carter with Katie Couric after an interview at the 2016 Republican National Convention. <br>(Video courtesy of William Carter)</div>\n\n<p>In high school, I ran for school elections. I worked on campaigns. And in 2016, I was a delegate for Georgia at the Republican National Convention in Cleveland. As an 18-year-old walking on the convention floor for the first time, it was amazing... </p>\n<p>Being there was so surreal. Looking back at my Snapchat videos, I was at the top of my game. It seemed like the start of the greatest journey of my life. I will never forget casting my vote during roll call, and the big reveal when Donald Trump walked on stage, and I’m screaming, “Donald!!! Oh my God, it’s Donald!!!”</p>\n<p>Here I am now in 2020. I’m not sure of my place in the party anymore. I’m 23 now and party politics feels complicated. </p>\n<p>Don’t get me wrong - I’m not part of the 76% of college students who look unfavorably on the GOP, according to <a class=\"link blue underline underline-hover hover-dark-red\" href=\"https://knightfoundation.org/reports/college-students-voting-and-the-covid-19-election/\" rel=\"nofollow\" target=\"_blank\">a recent Knight poll.</a> I support Trump. And the GOP is my home, even though I don’t support the Republican Party platform word-for-word. My main frustration is with the party establishment —  they make it hard for young people to break through.</p>\n<div class=\"center f7 gray\"><img loading=\"lazy\" class=\"db lazyload w-100\" src=\"articles/WilliamCarter_FeatureImage_PhCrTheresaCarter-flip.jpg\">\n(Photo courtesy of William Carter)</div>\n\n<p>Where I grew up in Savannah, Georgia, history is perfectly preserved. It was one the few cities that didn’t burn down in the Civil War. Stuff is old here. Politicians going as far back as the American Revolution are remembered, and buried.</p>\n<p>When I walk through Savannah’s Colonial Park Cemetery, one of the oldest cemeteries in the United States, I’m literally standing in the gravesite where individuals who helped form this nation are buried. When you grow up surrounded by long-term political legacies that go back hundreds of years, is it really any surprise that I had an interest in politics at such a young age? </p>\n<p>I recently went to visit some of my old teachers who knew me from high school. I had big plans for myself back then. </p>\n<p>“I’m still a little shocked you aren’t a card-carrying Republican anymore. I’m still processing that,” said Shelly Roberts, my high school teacher who has watched me through this journey. </p>\n<p>She didn’t expect me to say that I’m weighing my place in the party. “But you know, I think in a way it's good,” she added. “Yes, when you were a freshman, you were very rigid, like: ‘I’m a conservative and this is what I think and this is my box.’ And I think definitely by the time you were a senior, you had relaxed those parameters. You weren’t trying to box yourself in anymore. And I think with all that has occurred in our country politically-wise, with the Republican Party in general — how Trump really has completely reshaped how it works — we don’t really know what's going to happen.” </p>\n<p>She might be right. Trump has changed politics as we know it. And our parties need work. </p>\n<p>Right now, too much happens behind closed doors, and too many politicians don’t want to relinquish their power, and let the next generation of leaders in. Instead they have secret meetings cloaked with cigar smoke. </p>\n<p>As someone who wants to contribute in some way, I’m realizing there isn’t necessarily a clearcut path for me — there are so many twists and turns and potholes. I want to see the party embrace the younger generation and realize that it is time for a change. I’m going to do my best to stick with the GOP until that happens.</p>\n<p><i>Also featured on <a class=\"link blue underline underline-hover hover-dark-red\" href=\"https://www.npr.org/programs/morning-edition/\" rel=\"nofollow\" target=\"_blank\">NPR’s Morning Edition</a>.</i></p>","audioWaveform":"WzAuNjM4LDAuMjg2LDAuNDkyLDAuMzIzLDAuNDYyLDAuMjgzLDAuNDQyLDAuMzc3LDAuNDQ0LDAuNDM1LDAuMjM0LDAuNjY4LDAuNTg4LDAuNzE3LDAuNjQ1LDAuNDM2LDAuNDYxLDAuNDY1LDAuMzY1LDAuMzQ4LDAuNTcyLDAuNDksMC41NiwwLjQxOCwxLDAuNjk2LDAuNTgxLDAuNjkyLDAuMzg4LDAuNTk4LDAuNjQxLDAuNTQzLDAuNTE1LDAuMzM5LDAuMzc0LDAuNjMyLDAuNzExLDAuNDQyLDAuNTcsMC40OCwwLjU2NSwwLjU0MSwwLjU1MiwwLjQ3NywwLjY3NCwwLjUwMiwwLjYyNSwwLjc1MiwwLjMwNywwLjc1LDAuODgzLDAuNjQ4LDAuNDA3LDAuMzkzLDAuNjY3LDAuNTA5LDAuNTU5LDAuMzc2LDAuNjg4LDAuMzk0LDAuNDQyLDAuNDk1LDAuMzA5LDAuNTE0LDAuMzA3LDAuNDczLDAuMTY5LDAuMjUyLDAuMTY0LDAuMjA0LDAuNDg5LDAuMzYsMC41MzUsMC4yMDYsMC4xODQsMC4yMTgsMC4xNDUsMC4xNDUsMC4wODcsMC4xODYsMC4xNTMsMC4wOSwwLjEyOSwwLjEwNiwwLjIwNiwwLjEzNSwwLjE2MiwwLjE4NSwwLjA5MiwwLjEwNywwLjI3MSwwLjM2OSwwLjQwMiwwLjQxMywwLjUwMSwwLjU0NywwLjQ4NiwwLjM3MywwLjQ4MiwwLjM4OSwwLjQ1OCwwLjUyLDAuMzc0LDAuMzgyLDAuNDE2LDAuNTA3LDAuMjUyLDAuNTUyLDAuMzEsMC4zOTNd","slug":"hey-gop-younger-gen-wants-in","authorslug":"william-carter"},{"type":"story","feature":"false","format":"interactive","location":"El Paso, TX","title":"Latinx Voices: The Politics of Language in Borderland, America","author":"Antonio Villaseñor-Baca","date":"10/26/20","featureImage":"articles/Antonio-bordertune-crop.jpg","featureImageSmall":"articles/Antonio-bordertune-crop-small.jpg","featureImageCaption":"Antonio Villaseñor-Baca heightened the effects of this image of the U.S.-Mexico border to capture how he sometimes sees it, from the point of view of his home on the El Paso side.","featureImageCredits":"Photo: Antonio Villasenor-Baca,","summary":"As a writing student in El Paso, Texas, Antonio Villaseñor-Baca is especially attuned to the politics of language at the U.S.-Mexico border and the way it shapes the so-called Latinx vote. But for anyone growing up on the border, words open windows onto whole ways of life.","text":"","paragraphs":[{"english":{"text":"<p>Being a Borderlander means navigating more than physical checkpoints. We maneuver through accents, words, phrases, entire languages. </p>\n<p>I don’t just mean inventing new terms on the fly that aren’t Spanish or English but a mixture of both. And I don’t just mean spotting the partly-hidden exit signs on Interstate-10 that point me from El Paso, Texas to Ciudad Juárez, Mexico. Life on the border hangs on every tweet and speech a president gives. Words can bridge divides or split households. On the border, language causes tragedies and heals us from them. </p>\n<p>Words have a history of power on the border. It’s not too long ago that my grandparents would cross the bridge from Ciudad Juarez into downtown El Paso for school at <a class=\"link blue underline underline-hover hover-dark-red\" href=\"https://www.elpasotimes.com/story/sports/college/1966championship/2016/03/19/texas-westerns-1966-season-recap/81781526/\" rel=\"nofollow\" target=\"_blank\">Texas Western College</a> in the 50s. On their way to class, they’d be hit with messages that told them they didn’t belong.</p>"}},{"english":{"text":"<p>“I would have to take the bus from my house in Juarez and then take the streetcar and then take the bus to Cathedral (High School) or we ended up walking,” my grandfather remembers. “I’ll never forget, once we got off the streetcar en la calle de El Paso, and walking toward the San Jacinto Plaza, there was a restaurant and there was a big sign on the window that said ‘no dogs, negroes, or Mexicans allowed.’”</p>"},"spanish":{"text":"<p>“Tomaba el camión de mi casa en Juárez y luego tomaría el tranvía y luego otro camión a Catedral (la prepa) o terminamos caminando,” mi abuelo explica. “Nunca se me olvidará, una vez nos bajamos del tranvía en la calle de El Paso, y caminando hacia San Jacinto Plaza, había un restaurante y en la ventana decía “no dogs, negroes, or Mexicans allowed”.</p>"}},{"english":{"text":"<p>As my grandfather knows first-hand, the border has always been at the forefront of U.S. politics and some of the darker aspects of history. In fact, the U.S.-Mexico border was actually where the Nazis found the idea of <a class=\"link blue underline underline-hover hover-dark-red\" href=\"https://www.vox.com/2019/7/29/8934848/gasoline-baths-border-mexico-dark-history\" rel=\"nofollow\" target=\"_blank\">using toxic chemicals for the gas chambers</a>. </p>\n<p>But as Viridiana Villa, a DACA recipient and Borderlander said in a <a class=\"link blue underline underline-hover hover-dark-red\" href=\"http://radiobilingue.org/en/noticias/economia/edicion-mexico-367/?fbclid=IwAR1XEXRy2mf6vI3V9RP2jixnE3D6-i9gGxhhFMTcQpC6dGzinYGekcdHWKo\" rel=\"nofollow\" target=\"_blank\">report for Radio Bilingue</a>, “El término ‘frontera’ es de uso externo.” I agree. “Border” is often a talking point framed by external forces. But those forces are powerful. Language shapes most if not all aspects of life on the border, and for people who live here, there is nothing foreign in how we speak or see ourselves. And yet, our words can create a disconnect in how we relate to the world.  </p>\n<p>Just look at the pets I grew up with. My mother named her two dogs, Mozart and Picasso, after an Austrian composer and Spanish painter respectively. My uncle chose a French literary figure and Italian painter for his dogs, Dante and Da Vinci. As a family rooted on the border with stronger ties to Chihuahua than to the state of Texas, let alone any European culture, why was it that my family’s influences seemed to originate in France and not the country we actually came from? </p>\n<p>My mother went to an all-girls private Catholic high school in El Paso and is now a tenured professor of Rhetoric &amp; Writing Studies at the University of Texas.</p>"}},{"english":{"text":"<p>“Because of my schooling. I was taught about the arts and we took a class on the humanities. That’s where I learned about all these artists...I didn’t see it as ‘American.’ I saw it as being taught about culture,” she said.</p>"},"spanish":{"text":"<p>“Por la escuela; me enseñaron de estos artistas y tomamos una clase de las humanidades. Ahí es donde aprendí de todos estos artistas...No lo vi como algo ‘Americano’. Lo vi como si me estuvieran enseñando cultura,” ella dijo.</p>"}},{"english":{"text":"<p>But what about Mexican culture? Maybe members of my family on the Texas side of the border sometimes turn away from the culture of their parents because the generations who immigrated before them saw the U.S. as a land of opportunity. </p>\n<p>The exception to this affinity for U.S. culture, however, shows up in politics. Latinx voter rates in the U.S. <a class=\"link blue underline underline-hover hover-dark-red\" href=\"https://www.theatlantic.com/politics/archive/2020/09/pandemics-assault-latino-political-power/615979/\" rel=\"nofollow\" target=\"_blank\">are low</a> despite perpetual rises in the Latinx eligible voting pool. This is especially true on the <a class=\"link blue underline underline-hover hover-dark-red\" href=\"https://www.houstonchronicle.com/politics/texas/article/Democratic-stronghold-texas-joe-biden-texas-border-15616152.php\" rel=\"nofollow\" target=\"_blank\">border</a>, where — if the <a class=\"link blue underline underline-hover hover-dark-red\" href=\"https://elpasomatters.org/2020/03/11/el-paso-primary-voters-were-older-this-year-than-in-2016/\" rel=\"nofollow\" target=\"_blank\">primaries</a> in El Paso were any indication — young voters are much less likely to head to the polls than older ones. As a self-identifying Chicanx voter, I attribute these rates at least in part to a linguistic exclusion of my community in the political realm. </p>\n<p>I don’t mean a lack of Spanish written pamphlets and ads either. </p>\n<p>The border is a place where voters can be engaged or lost with the utterance of a single term or phrase. Are you speaking to someone who identifies as Latino? Latinx? Hispanic? Mexican? Mexican-American? Guatemalan? Or Chicano or Chicanx, terms that are slowly but surely coming back into use by people my age, who see the term as<a class=\"link blue underline underline-hover hover-dark-red\" href=\"https://www.nbcnews.com/news/latino/chicano-renaissance-new-mexican-american-generation-embraces-term-n869846\" rel=\"nofollow\" target=\"_blank\"> inclusive and politically powerful</a>.  </p>\n<p>2016 was a telling year: an election that resulted in a win for a president who launched his campaign by calling Mexicans rapists and “bad hombres.” Remember when he considered <a class=\"link blue underline underline-hover hover-dark-red\" href=\"https://thehill.com/policy/national-security/503279-bolton-book-trump-said-itd-be-cool-to-invade-venezuela-claims\" rel=\"nofollow\" target=\"_blank\">invading Venezuela</a> and mistook Mexico for a continent? </p>\n<p>But if we look back, Hilary Clinton’s campaign efforts to appeal to Latino voters fell a few zarapes short, too. Tim Cain speaking broken Spanish and one commercial with Vicente Fernandez weren’t enough to awaken what Jorge Ramos <a class=\"link blue underline underline-hover hover-dark-red\" href=\"https://www.latinousa.org/2017/03/13/sleeping-giant-slayed-2016/\" rel=\"nofollow\" target=\"_blank\">called</a> “the sleeping giant” that was the Latino vote. How is it that the party that supposedly advocates for immigration reform and gave us the Dreamers’ Act seems to be<a class=\"link blue underline underline-hover hover-dark-red\" href=\"https://www.vox.com/2020/9/9/21420401/latino-vote-democrats-joe-biden-chuck-rocha\" rel=\"nofollow\" target=\"_blank\"> losing its grip</a> on the Latinx vote? </p>\n<p>Since that 2016 election, the Democratic Party’s two most prominent Latinx political figures have struggled as much within their own party as against the one they oppose. <a class=\"link blue underline underline-hover hover-dark-red\" href=\"https://www.nytimes.com/2020/08/21/opinion/Democrats-Election-Latinos-Convention.html\" rel=\"nofollow\" target=\"_blank\">Alexandria Ocasio-Cortez and Julian Castro had how much time at the Democratic National Convention</a>? That’s fine though, because we totally needed to hear from John Kerry and Bill Clinton…</p>\n<p>With the pandemic-riddled year of 2020 coming to an end, we are seeing more concrete examples of how language is used politically and the direct impacts it can have on representation in political spheres — and even how we tell our own stories. </p>\n<p>On the border, I see it every day because Spanish is a gendered language, and at my university, students are pushing for linguistic forms that don’t play into the gender binary. I’m the online editor and a reporter at Minero Magazine, a bilingual publication at the University of Texas at El Paso. Our newsroom recently switched to inclusive language. The change came about accidentally, when I turned in a story using non-gendered words, inserting an “x” whenever a gender-assuming article or modifier was used. The magazine’s leadership made the decision to make inclusive language the new standard. </p>\n<p>“There have been various efforts to make Spanish more inclusive,” said Grecia Sanchez, who was Editor-in-Chief of Minero Magazine at the time. “First, the ‘@’ was used, instead of todos/todas, tod@s was used. After that came the ‘x.’ The problem with these morphemes is that you can’t pronounce them. You can’t use that orally. Simply, ‘e’ is the one being used to satisfy the oral aspect of the change. And that’s the only difference. They have the same purpose, of including and to conceive of the existence of non-binary people and other identities in the Spanish language.” </p>\n<p>These changes have major implications for political reporting. We make space for people that language had been excluding, even if that goes against the style guidelines of the Associated Press. </p>\n<p>“For Minero, it is huge,” Sanchez said. “It’s not only that we’re making sure that reporters ask for people’s pronouns, but also that the commitment, at least for Minero, goes beyond bilingualism now. It’s more of respecting people’s identities and making sure they are represented in the media, in their stories, and accurately represented in what they talked about when doing interviews with us.”</p>\n<p>Maria Ramos is the new Editor-in-Chief at Minero who took over leadership of the magazine this academic year. </p>\n<p>“So right now above all else, the most important thing is respecting who a person is, what they are feeling, and how they feel, how they want to be represented,” said Ramos. Just as the Associated Press recently <a class=\"link blue underline underline-hover hover-dark-red\" href=\"https://apnews.com/article/71386b46dbff8190e71493a763e8f45a\" rel=\"nofollow\" target=\"_blank\">changed its rules</a> and now capitalizes the “B” in Black, Ramos is hoping in the future, the AP will update its standards for inclusive language to name and cite Spanish-speaking communities. </p>\n<p>This is the politics of language. </p>\n<p>Small publications like Minero can be a driving force behind larger institutions like the AP accepting these changes. Likewise it is the voter who can and must force changes on our governing institutions. Or sometimes it’s the individual politician who’s willing to speak out against the powerful. When AOC delivered that <a class=\"link blue underline underline-hover hover-dark-red\" href=\"https://www.usatoday.com/story/news/politics/2020/07/24/aoc-response-ted-yoho-read-text-rep-ocasio-cortezs-speech/5500633002/\" rel=\"nofollow\" target=\"_blank\">scathing rant</a> on the floor of congress after a Republican senator referred to her with a misogynistic slur, she challenged not only him, but more so the men who watched it happen, the boys growing up and seeing these words used who may still be unsure of their power and symbolism. </p>\n<p>Black and Brown voters cannot be ploys to win elections. We are constituents helping to shape the political sphere, with every word we speak. </p>\n<p>As I begin my final year in an MFA program, I realize that some of the most important lessons in writing have come from outside my workshops and had little to do with craft. A poem, a short story, a novel, an article, any piece of writing: it isn’t powerful because it was written well or sounds pretty. It only starts to matter when it gives readers agency. It matters when it helps people to heal —&nbsp;and act.</p>"}}],"slug":"latinx-voices-the-politics-of-language-in-borderland-america","authorslug":"antonio-villasenor-baca"},{"type":"story","feature":"false","format":"video","videourl":"https://www.youtube.com/watch?v=nESdEZQztwA","videoid":"nESdEZQztwA","title":"Is College Even Worth It? First-Gen College Student Talks Being Broke and the 2020 Ballot","author":"Erianna Jiles","date":"10/30/20","location":"St. Paul, MN","featureImage":"articles/iscollegeworth.jpg","featureImageSmall":"articles/iscollegeworth_small.jpg","summary":"For this first-generation college student, making ends meet and paying for tuition hasn’t been easy. Balancing school with working at a gas station and living with 4 other people has Erianna Jiles questioning: Is college really worth it? And will things change for people like her after the 2020 election?","text":"<p>For this first-generation college student, making ends meet and paying for tuition hasn’t been easy. Balancing school with working at a gas station and living with 4 other people has Erianna Jiles questioning: Is college really worth it? And will things change for people like her after the 2020 election?</p>","slug":"is-college-even-worth-it-first-gen-college-student-talks-being-broke-and-the-2020-ballot","authorslug":"erianna-jiles"},{"type":"story","feature":"true","format":"text","location":"Multiple","title":"Young America in 2020: In Our Own Words","author":"18-to-29 Now Team","date":"10/29/20","featureImage":"articles/YR-Popsugar-Thumbnail.jpg","featureImageSmall":"articles/YR-Popsugar-Thumbnail_small.jpg","featureImageCaption":"18-to-29 Now Team","featureImageCredits":"Photo: 18-to-29 Now Team","summary":"A conversation on activism, having difficult political conversations and what gives us hope.","text":"<p>People assume a lot about Gen Z and young Millennials: we’re overly sensitive, we’re not willing to work hard, or we’re just downright entitled. Having grown up in a post-smartphone society, we’re consumed by social media. We aren’t engaged enough in the political system or take politics too personally. People harbor these assumptions without actually talking — or, better yet, listening — to young adults. Though this isn’t a new phenomenon by any means, it is an especially critical mistake as we approach the presidential election.</p>\n<p>Young and first-time voters will make up a sizable voting bloc come Nov. 3. Millennials and Gen Z <a class=\"link blue underline underline-hover hover-dark-red\" href=\"https://www.brookings.edu/blog/the-avenue/2020/07/30/now-more-than-half-of-americans-are-millennials-or-younger/\" rel=\"nofollow\" target=\"_blank\">now make up 37 percent of the eligible voting population</a>, according to census data analyzed by the Brookings Institution. According to CIRCLE, <a class=\"link blue underline underline-hover hover-dark-red\" href=\"https://circle.tufts.edu/2020-election-center\" rel=\"nofollow\" target=\"_blank\">youth voter-registration numbers are higher in a number of states</a> than in 2016. What’s more, Rock the Vote recently <a class=\"link blue underline underline-hover hover-dark-red\" href=\"https://www.cnn.com/2020/09/24/politics/national-voter-registration-day-numbers/index.html\" rel=\"nofollow\" target=\"_blank\">had its most successful National Voter Registration Day ever</a> on Sept. 22, with an estimated 200,000 people submitting applications or checking their registration status.</p>\n<p>To dive deeper into this political moment, 18-to-29 Now teamed up with <a class=\"link blue underline underline-hover hover-dark-red\" href=\"https://www.popsugar.com/news/\" rel=\"nofollow\" target=\"_blank\">POPSUGAR</a>. Read and watch video excerpts of the conversation on <a class=\"link blue underline underline-hover hover-dark-red\" href=\"http://bit.ly/psxyrmedia\" rel=\"nofollow\" target=\"_blank\">POPSUGAR</a>.</p>","slug":"young-america-in-2020-in-our-own-words","authorslug":"18-to-29-now-team"},{"type":"story","feature":"false","format":"audio","location":"Missoula, MT","audioURL":"https://www.podtrac.com/pts/redirect.mp3/audio.wnyc.org/radiorookies/radiorookies110220_thirdpartyvoters.mp3","title":"Voting Third Party: It’s Political and Personal","author":"Kaleigh Cunningham","date":"11/02/20","featureImage":"articles/montana.jpg","featureImageSmall":"articles/montana_small.jpg","featureImageCaption":"Montana has many Independent voters and issues like personal freedoms and Patriotism are important to them.","featureImageCredits":"Photo by Michael Williamson/The The Washington Post via Getty Images","summary":"Young voters vote third party more than any other age group. Kaleigh Cunningham wants people to understand they aren't just trying to shake up the system — a lot of thought goes into their vote.","text":"<p>Growing up, my parents didn’t vote. All I knew was that there were Republicans and Democrats. My first memory of being politically aware was when I was 10 years old. It was during the Bush/Kerry presidential election and I found out that the vice president had a lesbian daughter but didn’t support gay marriage. I told all of my friends it was wrong to be so hypocritical. When I think about it, that was the beginning of me questioning the role of government in people’s lives. </p>\n<p>I grew up as an only child in rural Pennsylvania with a single mom battling addiction, while my dad tried to raise me over the phone from 2,000 miles away. He sent child support each month but it went straight to my mom’s drinking funds. We only ate when food stamps were distributed, the roof over my head was a part of Section 8, and school lunches were my only guaranteed meal. But I never thought about who was behind these programs until my junior year of high school when my friend Amy told me to check out the Libertarian Party website. Reading their party platform, my main reaction was just “Wow, this makes sense.” I already agreed with their stance on social issues, such as criminal justice reform and immigration. I began to understand that capitalism isn’t evil and that my ability to exit poverty was tied directly to the ability to work.</p>\n<p>I started to realize my life as a child had been dictated by our local and federal government. They give you just enough to stay alive and if you get a job and earn too much money, disability goes away and rent increases. My dad’s girlfriend Laynie and I spoke recently about my childhood and my politics. “I know you feel like the Democratic Party has kept your mother where she’s at. And the Republican Party is for the rich people, which wasn’t something any of us ever had. So with those two options, I can see where you would go Libertarian. You were looking for something that would help people, not just keep them — in your opinion — where they’re at.”  </p>\n<p>My mom told me when she finally won her disability case that she couldn’t get a job if she wanted to keep those benefits. And what my mom had heard from her friends about libertarianism was what most people are often told: we’re greedy capitalists who don’t want to support the least vulnerable. I asked my mom what she thought when she heard that from her friend and she told me it scared her that someone might take away her benefits. But I would never advocate for something I thought would make my mom’s life more difficult. </p>\n<p>It’s hard to explain to my mom how libertarianism works and why I think it could make life better, even for the most vulnerable. I do think limiting government programs would create more opportunities for people to live more fulfilling lives. I wanted that for me and my mom as well.</p>\n<p>Today, I am registered as an independent. I make my own decisions on who to vote for and that usually means voting third party. This year, my dad worries that the stakes are too high, even though he voted third party in 2016. “I wish there was someone else to vote for, I really do. But in this particular election, there is no way I can vote third party.”  But I don’t feel that I have to choose between the “lesser of two evils.” </p>\n<p>My friend Kyle Mack is an independent who also tends to vote third party, “I think there’s often this view of independents as they’re kind of just like lazy voters that just haven’t put in the time to figure out what team their on, so they’re kind of wishy washy with their vote. No. I have a very specific political philosophy and I need someone to inspire me to actually go out and support them.” </p>\n<p>You may be thinking that we’re just rebellious and trying to shake up the system, not thinking about the possible consequences, but a lot of thought goes into our vote. More and more young voters are choosing not to register with either major party. We want a new set of ideas to vote for — because what we have now, clearly isn’t working.</p>","audioWaveform":"WzAuNDc4LDAuNjU1LDAuMzI1LDAuNjQxLDAuNDkxLDAuODA2LDAuNTY5LDAuNSwwLjU0MywwLjQ1OSwwLjc1MywwLjY4NywwLjI3OCwxLDAuNTYsMC41NTgsMC40MTIsMC41NywwLjM4NSwwLjc3LDAuNTQ0LDAuNTUsMC4yODUsMC43MTcsMC40NjgsMC42MTUsMC4zOTksMC43NDYsMC41ODksMC44NjUsMC42NTgsMC41NSwwLjQ1NCwwLjU0MywwLjU2MywwLjQ2MywwLjUzOCwwLjM2OCwwLjMzOSwwLjQ3MywwLjM5NywwLjIwOSwwLjQ0OSwwLjQ2NCwwLjM3MywwLjMzLDAuNDQ0LDAuMzcxLDAuNTUsMC43MTcsMC41MSwwLjM0OSwwLjc3NiwwLjcwNCwwLjQ1MSwwLjQyNCwwLjI4OSwwLjI2NCwwLjQ2MiwwLjM3NSwwLjQ1NywwLjQyMywwLjY4OSwwLjE3NSwwLjM4OSwwLjQyMywwLjE1NCwwLjUwMywwLjM5MSwwLjM1OCwwLjUxOSwwLjQ4NywwLjM5NCwwLjI3NiwwLjY1OCwwLjQ1OSwwLjM2MiwwLjM3NCwwLjYyLDAuNDk0LDAuNTc4LDAuNDM0LDAuNjU0LDAuNTM0LDAuNzI0LDAuNzM0LDAuNzk3LDAuNzksMC43OCwwLjUzNiwwLjQ1OCwwLjM2NywwLjMwOCwwLjI4NywwLjMyOSwwLjM3LDAuNTQsMC4yNjksMC4xOTcsMC44ODgsMC43MiwwLjUxOSwwLjM0NCwwLjcyNCwwLjU2NiwwLjQ5MywwLjM5OCwwLjU5NCwwLjQwNSwwLjQzOV0=","slug":"voting-third-party-its-political-and-personal","authorslug":"kaleigh-cunningham"},{"type":"story","feature":"false","format":"video","location":"Brooklyn, NY","videourl":"https://www.youtube.com/watch?v=feGpxE6nDYM","videoid":"feGpxE6nDYM","title":"How My Dad's Prison Release Changed My Views This Election","author":"Kharon Benson","date":"11/02/20","featureImage":"articles/Parole_2020_site.jpg","featureImageSmall":"articles/Parole_2020_site_small.jpg","summary":"After 27 years, Kharon Benson's father was released from prison after a frustrating and complicated parole process. Now, ahead of the election, Kharon investigates some of the flaws in the criminal justice system and what the candidates will do about it if they win.","text":"<p>After 27 years, Kharon Benson's father was released from prison after a frustrating and complicated parole process. Now, ahead of the election, Kharon investigates some of the flaws in the criminal justice system and what the candidates will do about it if they win.</p>","slug":"how-my-dads-prison-release-changed-my-views-this-election","authorslug":"kharon-benson"},{"type":"story","feature":"false","format":"text","location":"Multiple","title":"Waiting and Watching: A Q&amp;A With 18-to-29 Now Correspondents","author":"18-to-29 Now Team","date":"11/05/20","featureImage":"articles/ElectoralCollegeImage.jpg","featureImageSmall":"articles/ElectoralCollegeImage-small.jpg","featureImageCaption":"Boeing 787 Dreamliners sit on the assembly line at the Boeing Factory in Everett, Washington.","featureImageCredits":"Photo: yraffic_analyzer/Getty Images","summary":"\"As a young person, I still feel as though there's still a bigger and older generation making the rules and setting the tone.\" Erianna Jiles, 22","text":"<p></p>\n<div class=\"w-100 w-50-ns ph3-ns fr cb center f7 gray\"><img loading=\"lazy\" class=\"db mw5 lazyload\" src=\"profiles/12_AntonioBaca.png\"></div>\n<b>Antonio Villaseñor-Baca, 24</b><br>\n<b>El Paso, Texas</b><br>\n<i>Xicanx bilingual journalist, photographer, poet and writer</i>\n\n<p><b>Did you vote? How did you vote?</b><br>\nI did early voting. Drove to the community college site close to my house.</p>\n<p><b>What's most on your mind during this election week?</b><br>\nI think Van Jones said it perfectly on Tuesday night; I was looking for a repudiation of the atrocities under and thanks to this administration from U.S. voters. That didn’t happen. And as Biden looks closer and closer to the win, it makes me sad that objective undeniable acts and rhetoric weren’t a dealbreaker for so many. </p>\n<p><b>What are you seeing/hearing in your community? </b><br>\nStill a lot of nail biting. A few sighs of relief with every electoral vote Biden gets. But I’m seeing a lot of frustration. A local favorite for mayor didn’t make the run off and she was the first true representation of El Paso’s political values (as she was endorsed by Bernie Sanders who won in El Paso) and this is largely thanks to people voting straight Democrat on the ticket instead of going candidate by candidate. To answer briefly and directly, it’s a bag of mixed emotions. </p>\n<p><b>Looking ahead, what do you imagine will be the top issues in the months to come? </b><br>\nI’m sure the “political process” will be discussed a lot. This election seemed crazy and there was so much worry about votes being counted, where do people go to see who won, can you believe if someone won, etc. But people will be looking over their shoulders and questioning each other. This administration was one of divisiveness, or one that was very polarizing. But election night was filled with guesses of the “Latino” vote and the “Black” vote. Rick Scott was on ABC mentioning the Castros and how that impacted Florida and the “Hispanic” vote. Arizona was a huge shock and it seems like Pima and Maricopa counties were critical to that upset and those are large Latinx communities, Maricopa being where this administration started its tenure by pardoning a man for committing essentially war crimes. So I think, or at least hope, that the conversation is about how to engage with voters sincerely going forward and not just voting blocks. People do feel disenfranchised, like this process excludes them. </p>\n<p><b>Do you think young people feel represented in the political process?</b><br>\nNo, I don’t. I don’t think many young voters were excited about a Biden/Harris ticket. It was just a neutral against an evil. But nobody close to our age group or with our ideals was taken seriously in this process. Definitely excited about Omar Ilhan and the prospect of playing “Among Us” with Alexandria Ocasio Cortez as her political career continues. Young people don’t feel taken into consideration; they’re just not going to wait anymore to be given a seat at the table when the house is on fire. </p>\n<div class=\"w-100 w-50-ns ph3-ns fr cb center f7 gray\"><img loading=\"lazy\" class=\"db mw5 lazyload\" src=\"profiles/5_Sher-Delva.jpg\"></div>\n<b>Sher Delva, 28</b><br>\n<b>Boynton Beach, Florida </b><br>\n<i>Member of the Democratic Socialists of America (DSA) and poet</i>\n\n<p><b>Did you vote?  </b><br>\nI did vote in this election, and I voted Democrat. Although Joe Biden was not my first choice in the primaries, I thought he was a better choice than Donald Trump. </p>\n<p><b>What's most on your mind during this election week? </b><br>\nI am anxious to see what the results of the election will be, but more importantly,  I am wondering how the country will take in the results of the election. There has been a significant amount of hints given by President Trump that indicate he will not handle the results of the election well if he is not the winner. I am fearing the reaction of the election. If Trump were to win, I’d fear for my rights as a woman.  After Amy Coney Barrett was sworn in, I started to fear my rights to my body when it comes to access to an abortion or birth control. In addition, during this election week, I really wanted Amendment 2 here in Florida to pass to increase the minimum wage to $15/hour. I am happy that we have heard the news of the amendment being passed. </p>\n<p><b>What are you seeing/hearing in your community? </b><br>\nIn my community, there is a lot of uncertainty.  People do not know what will happen after a winner is announced.  It could be violent or the results could be disputed.  People are anxious.  Many of my friends are not sleeping, and feel the weight of what potentially is to come.  I think people are really realizing how divided the country is.  People are either on one side or another, and it is a very divisive spectrum. There is a severe lack of unity, and there is a lot of anger and panic. </p>\n<p><b>Looking ahead, what do you imagine will be the top issues in the months to come? </b><br>\nIn the month ahead, I think the pandemic will remain a top concern. The question remains whether restrictions on businesses will continue or if masks will continue to be mandated.  Small businesses have suffered tremendously.  I know several small businesses that have shut down due to financial loss related to strict guidelines related to the pandemic. At the same time, I know people who have died because of catching the virus. Both are serious concerns, so I think we will continue to grapple with the best way to move forward until numbers decline or a vaccine is approved. </p>\n<p><b>Do you think young people feel represented in the political process?</b><br>\nFor the most part, I think young people feel they could be represented more. However, I am so proud of my DSA team for marching, canvassing and phone banking on behalf of Amendment 2.  I marched alongside several members of millennials and Gen Z DSA members, and the passing of Amendment 2 proved we were able to have an impact. It was a close vote, and I think our efforts helped raise awareness of the amendment and motivated people to vote for it.  I felt emotional when I saw the amendment pass because my mind instantly flashed to those who have to work multiple jobs to make ends meet. I thought of them, and how they will finally be on their way to making a more livable wage. The Florida minimum wage has not kept up with inflation, and the cost of living is astronomical. Gradually raising the minimum wage to 15/hr was absolutely necessary to keep up with the cost of living. The passing of the amendment highlighted how elections are more than just voting Democrat or voting for presidents, there are many amendments and local issues that have a huge impact on our daily lives. I hope people realize the power of paying attention to these issues and voting in more elections. </p>\n<div class=\"w-100 w-50-ns ph3-ns fr cb center f7 gray\"><img loading=\"lazy\" class=\"db mw5 lazyload\" src=\"profiles/9_Erianna-Jiles.jpg\"></div>\n<b>Erianna Jiles, 22</b><br>\n<b>St Paul, MN </b><br>\n<i>Creative writing student at Metropolitan State University</i>\n\n<p><b>Did you vote? How did you vote?</b><br>\nI voted sometime last week. I planned to go. I also had some older friends check in with me and ask weekly if I voted yet. I Googled my local polling station — a community center, and went right in. Took no more than 10 mins. </p>\n<p><b>What's most on your mind during this election week? </b><br>\nI've mostly been coaching and telling myself not to be on social media. Of course, I get on to get updated or to find comical relief through memes but — I have a content mind about everything. I have moments of negative feelings surrounding who I hope doesn't win but … I think we all do. </p>\n<p><b>What are you seeing/hearing in your community? </b><br>\nEveryone I know is pretty hush toned about it. Waiting and watching. I feel like as a Minnesotan, I am exhausted by everything still and the last thing I want to talk about are one's bets about who will win or not. If anything, we are all patiently waiting to hear the results. </p>\n<p>Looking ahead, what do you imagine will be the top issues in the months to come? \nIf Biden wins, I feel like the media will closely follow every move Biden and Harris makes to a \"T\". If Trump wins, the nation — at least the communities I'm a part of — will be very distraught and stunned. And Trump will just go down as being \"Trump.\" Either way it goes, either party will have to make some serious decisions about the health of the country (tackling COVID-19) and this continuous race war we can't seem to get over. I see protests and tears coming out of this election if we, the people, don't choose the \"right person.\"</p>\n<p><b>Do you think young people feel represented in the political process?</b><br>\nOutside of posting our \"I voted\" sticker pictures — no. As a young person, I still feel as though there's still a bigger and older generation making the rules and setting the tone. I feel young people are represented in the voting process but the long term benefits, I'm not sure. I definitely think more young people voted and got in tune with the culture of it this election than last. </p>\n<div class=\"w-100 w-50-ns ph3-ns fr cb center f7 gray\"><img loading=\"lazy\" class=\"db mw5 lazyload\" src=\"profiles/2_Laura-Bratton.jpg\"></div>\n<b>Laura Bratton, 23</b><br>\n<b>Wilmington, North Carolina </b><br>\n<i>Independent podcast producer</i>\n\n<p><b>Did you vote? How did you vote?</b><br>\nI voted early in-person for Biden-Harris and state/local Democrats.</p>\n<p><b>What's most on your mind during this election week? </b><br>\nI'm thinking about climate change and racial equity. We need to act fast if we're going to mitigate the harms of global warming, and I'm concerned what will happen to our coastal communities if we don't take action soon. Living in a community where the wounds of racism are still very much open and festering, I'm hoping Biden and Harris will be elected and that they'll stick to their word and address systemic racism through police reform and other policies. I'm also very excited about the prospect of having a woman as vice president. I didn't realize how much this excited me until I felt a pit in my stomach watching Trump overtake Biden in North Carolina on Tuesday night, though it's still too close to call. I feel less anxious knowing that, at the very least, Democrat Roy Cooper won the election for governor in North Carolina, since he's committed to acknowledging climate change, strengthening the responses of coastal communities, and addressing harms done to large numbers of low-income communities of color.</p>\n<p><b>What are you seeing/hearing in your community? </b><br>\nI live in the largest county in North Carolina to go red in 2016, but this year, New Hanover County went blue by a small margin (he won by 50.08%). My friends and I felt like we were on an emotional roller coaster watching the numbers come in for North Carolina — excited at the prospect of our state going blue, but trying not to get too hopeful. </p>\n<p>In my community, I've seen pickup truck parades for Trump hold up traffic, but I've also been a part of large protests against police brutality, made up of young liberals hoping for change. So my community is pretty split between young liberals and mostly older white folks who support Trump.</p>\n<p><b>Looking ahead, what do you imagine will be the top issues in the months to come? </b><br>\nI think the top issue in the coming months will be democracy and civil society. Trump has been questioning the outcomes of the election, and I'm worried that, with the large numbers of parading Trump supporters in my county, there will be a deep divide between people who accept the election outcome and people who don't.</p>\n<p><b>Do you think young people feel represented in the political process?</b><br>\nI think young people feel represented when politicians care about policies that represent the future of our world. When politicians avoid climate change, it feels like they don't care about the next generation of young people. It's like they're saying, \"Well, we're okay for now.\" Though I'm registered as unaffiliated, I feel represented by Democrats because they care about changes that need to happen to make our future liveable — in regards to addressing top issues on the minds of young voters like me, such as systemic racism and global warming.</p>","slug":"waiting-and-watching-a-q-and-a-with-18-to-29-now-correspondents","authorslug":"18-to-29-now-team"},{"type":"story","feature":"false","format":"text","location":"San Francisco, CA","title":"Notes From a DACA Recipient: Finally A Weight Is Lifted","author":"Juan Mireles-Palomar","date":"11/10/20","featureImage":"articles/Signs-cover-the-fence-in-front-of-the-White-House-Daca-Trump-Election.jpg","featureImageSmall":"articles/Signs-cover-the-fence-in-front-of-the-White-House-Daca-Trump-Election_small.jpg","featureImageCaption":"Montana has many Independent voters and issues like personal freedoms and Patriotism are important to them.","featureImageCredits":"Photo by Alex Edelman/AFP via Getty Images","summary":"There's reason for hope again, after living in limbo with DACA under Trump.","text":"<p>I couldn’t help but smile under my mask, seeing social media explode with the news that Donald Trump lost the presidency this weekend. I was on the bus on my way to work. The 4th day of waiting for my fate. As a young adult with DACA, my future was tied to this election – I had so much riding on it. I immediately began texting every one of my closest friends. But it wasn’t until later in the day that the news hit me, when I got messages from friends telling me to “ride the good energy.” It may sound cliché, but it really felt like a weight was lifted off my shoulders. The anxiety felt by the nation has been one that has been felt especially by people like me, people who are part of marginalized communities. The defeat of Donald Trump meant life or death to those communities that his administration willfully ignored or actively tried to pursue.</p>\n<p>I was out in the neighborhoods of San Francisco in the celebrations. And I wore my mask, but I wanted to revel with the big crowds in the city and celebrate with the communities that I grew to feel a part of — the LGBTQ+ district in the Castro, the Latinx community in the Mission. Despite the COVID restrictions, it almost felt like everyone needed a win in 2020 and we were willing to risk it to rejoice in the moment.</p>\n<p>I talked to my sisters shortly after the news and my first thought was that my sister Eva would finally be able to renew her DACA without fear of it being denied or being put into deportation proceedings. I immediately thought of other undocumented immigrants who, with a Biden administration, have renewed hope that once and for all, we’ll achieve citizenship for all. According to Joe Biden’s campaign website — which of course I’ve been checking and refreshing —he plans to work with Congress “<a class=\"link blue underline underline-hover hover-dark-red\" href=\"https://joebiden.com/immigration/\" rel=\"nofollow\" target=\"_blank\">keeping families together by providing a roadmap to citizenship for nearly 11 million undocumented immigrants.”</a></p>\n<p>It is my hope that in the coming years, we begin to see the Biden-Harris administration do just that, with the support of Congress. But immigration is not the only issue I’m watching. It is clear that we are headed towards a climate crisis and with Biden promising to re-enlist the United States into the Paris climate accord, I only hope to see the U.S. take climate change seriously after all the warning signs so many of us have lived through.</p>\n<p>I have SO many hopes for the next four years. It is renewed hope that the past four had managed to break down and smash into little pieces. Now, with the renewed spirit of activism across the country, we must continue to push for the change we want, no matter who’s in office. The U.S. has allowed Trump to take so much from me, my family and my communities. But now, with him gone, we can be sure in saying he will not take our hope with him.</p>","slug":"notes-from-a-daca-recipient-finally-a-weight-is-lifted","authorslug":"juan-mireles-palomar"},{"type":"story","feature":"false","format":"text","location":"Wilmington, N.C.","title":"Connecting the Dots on Climate Change and the Cost of Rent","author":"Laura Bratton","date":"11/10/20","featureImage":"articles/GettyImages-1036210578.jpg","featureImageSmall":"articles/GettyImages-1036210578-small.jpg","featureImageCaption":"Kenan Chance's home is surrounded by flood water as the river Lumberton river continues to rise in the aftermath of Hurricane Florence on September 19, 2018 in Lumberton, North Carolina.","featureImageCredits":"Photo: RJ Sangosti/The Denver Post via Getty Images","summary":"Laura Bratton, 23, has reported on hurricanes and climate change. But even she didn't realize how climate change was making it harder for her to find a place she could afford.","text":"<p>I grew up in Wilmington, North Carolina — a coastal city with a long and painful history dealing with hurricanes. When I thought about hurricanes, I almost always focused on resilience: our ability to piece our cities and towns back together with tarp brigades, chainsaw crews, and mass cleanup efforts. Then, through my work as a freelance journalist, I learned how certain coastal communities would be unlivable in a number of years. I started linking the stories I was documenting to flood zones, increases in flooding insurance, and socioeconomic inequities. And I began to understand that rising water temperatures in the Atlantic had an impact on multiple aspects of my own life, like the cost of my monthly rent. </p>\n<p>I moved back home after college because I wanted to be close to my family, to the southeastern coast I'd come to know and love during my childhood. And I naively thought apartments would be affordable. After all, it wasn’t New York or Los Angeles. But I found myself scouring Zillow and Facebook Marketplace for apartments that fit my budget and that would be comfortable. I saw one-bedrooms with no washer-dryer priced near $1,000, and two-bedrooms in poor condition priced even higher. That might seem reasonable, depending on where you live, but the minimum wage in North Carolina is stuck at $7.50 and I was making about $1,800 a month. </p>\n<p>I was working as a server at a breakfast diner, but the job I hoped to eventually pursue full-time was my gig in audio production at a local media platform, <a class=\"link blue underline underline-hover hover-dark-red\" href=\"https://shoresides.org\" rel=\"nofollow\" target=\"_blank\">Shoresides</a>. There I produced a podcast called “<a class=\"link blue underline underline-hover hover-dark-red\" href=\"https://shoresides.org/show/storm-stories/\" rel=\"nofollow\" target=\"_blank\">Storm Stories</a>,” and I spent my afternoons interviewing people about the long-term impact of Hurricane Florence. I remember sitting on the porches of gutted houses in Pender County, listening to a grandmother talk about her waterlogged family photographs, FEMA trailer and financial losses. I profiled survivors in several rural, coastal counties who were waiting upwards of 18 months to get back into their homes. People I interviewed struggled to find affordable rentals while their homes were rebuilt. Their situations were obviously much more extreme than mine, but <b><i>it didn’t occur to me that our trouble finding affordable housing was actually connected. Hurricanes and flooding have pushed up rents in coastal North Carolina. </i></b></p>\n<p>Housing advocate Bri Mellott, a member of New Hanover Tenants’ Union, recently told me that after Hurricane Florence, landlords “either immediately uprooted everyone living [in affordable housing units] or allowed the properties to molder into non livability and blamed renters for the damage without fixing it until tenants left or were evicted.” National news sources have drawn these connections explicitly, but local mainstream media here in Wilmington typically tackle the topics as separate issues. I wondered why, locally, people weren’t generally asking the hard questions I’d started to think about.\u000b\nAdam Wagner, a reporter for The News and Observer who covers the effects of hurricanes, says it’s hard to decide when to include the connection to climate change and when to leave it out, because every story relates to climate change in some way. He says the impact of climate change is small for each individual hurricane, and sometimes he doesn’t feel it’s worth including in every story about storms and their damage to communities and homes. </p>\n<p>“In too many small details, the point gets lost. Too much noise.” Wagner added that climate change made Hurricane Florence only 4% wetter, and he didn’t know if this would be a meaningful number to his readers. Sometimes Wagner and other reporters will give a nod to the crisis in their reporting rather than stating the link outright, “I think that there is a way to address climate change in a story that isn't ostensibly about climate change … this sort of mentality of, ‘Oh, it's just a graph or two somewhere in the story’ … but I'm not sure if it's enough.”</p>\n<p>And then there’s the politics of my region. New Hanover County swings back and forth — in 2016 it went red for Trump, but so far this year, it’s leaning blue for Biden in the 98% of votes counted so far. However, Republicans maintain control of the House and Senate in North Carolina, as they have <a class=\"link blue underline underline-hover hover-dark-red\" href=\"https://www.newsobserver.com/news/politics-government/election/article246776737.html\" rel=\"nofollow\" target=\"_blank\">since 2010</a>. A recent <a class=\"link blue underline underline-hover hover-dark-red\" href=\"https://www.cleanenergyconservatives.com/wp-content/uploads/2019/02/CFCE-2020-Final.pdf\" rel=\"nofollow\" target=\"_blank\">poll</a> by the nonprofit Conservatives for Clean Energy shows that only 10% of Republicans in North Carolina said climate change is a “serious issue that requires immediate action,” compared to 59% of Democrats. </p>\n<p>After Hurricane Florence, New Hanover County lost 3,000 affordable housing units, according to Steve Spain, the executive director of Cape Fear Habitat for Humanity. But he doesn’t push the issue of climate change publicly.  “As a housing advocate, I would probably avoid the topic because I don't want to piss somebody off who thinks climate change isn’t real,” he said. “I would rather try and get their support for things that I know need to be done.” Instead, he’s focusing on fights he thinks he can win, like creating affordable local rental and homeownership opportunities.</p>\n<p>Despite the rising cost of housing in Wilmington and continued impacts from seasonal hurricanes, the population has increased about 19% over the past 10 years. But even as each major hurricane in the area depletes our affordable housing stock, many people turn a blind eye to the coming storms and what they might mean for our city’s existence. After Hurricane Katrina, New Orleans residents who returned to the city either found their rents were higher or their low-income housing had turned to mixed-income apartments and condos. People were displaced both from and within their city.  </p>\n<p>We have to think beyond tarp brigades and chainsaw crews. I wonder if we will make collective, meaningful connections between climate change and its impacts on our daily lives, like the rising cost of housing, regardless of whether or not there’s a storm brewing on the horizon. We must make this transition to honestly assess our future as coastal communities, to prevent and prepare rather than simply respond. We have to deal with our shrinking stock of affordable housing and address barriers to home ownership. By wrestling with the facts, we might have a fighting chance to address the global climate disaster that’s already changing our coastal cities. </p>\n<p>As someone who’s grown up in this region and reported on its hurricanes, I took a long time to face these realities myself; I was scared to admit the worst case scenario might be real. But now that I’m doing the work and connecting the dots, I’m weirdly less afraid. Because I know what the future might hold, and I am working as a citizen and a journalist to make lifestyle changes and collaborate on telling meaningful stories so we can see what’s happening all around us. By telling ourselves the truth, I hope we’ll fight for the survival of our entire communities, not just the wealthier and whiter parts.</p>","slug":"connecting-the-dots-on-climate-change-and-the-cost-of-rent","authorslug":"laura-bratton"}],"main":{"type":"about","featured":[{"title":"Connecting The Dots On Climate Change and The Cost Of Rent","slug":"connecting-the-dots-on-climate-change-and-the-cost-of-rent"},{"title":"Notes From a DACA Recipient: Finally A Weight Is Lifted","slug":"notes-from-a-daca-recipient-finally-a-weight-is-lifted"}],"latest":[{"title":"Waiting and Watching: A Q&amp;A With 18-to-29 Now Correspondents","slug":"waiting-and-watching-a-q-and-a-with-18-to-29-now-correspondents"},{"title":"How My Dad's Prison Release Changed My Views This Election","slug":"how-my-dads-prison-release-changed-my-views-this-election"},{"title":"Voting Third Party: It’s Political and Personal","slug":"voting-third-party-its-political-and-personal"},{"title":"Latinx Voices: The Politics of Language in Borderland, America","slug":"latinx-voices-the-politics-of-language-in-borderland-america"},{"title":"A Democratic Socialist on Election 2020: \"I’ll vote for Biden but I want more for the country","slug_custom":"to-move-forward-after-bernie-a-young-progressive-looks-to-the-past","slug":"to-move-forward-after-bernie-a-young-progressive-looks-to-the-past"},{"title":"Is College Even Worth It? First-Gen College Student Talks Being Broke and the 2020 Ballot","slug":"is-college-even-worth-it-first-gen-college-student-talks-being-broke-and-the-2020-ballot"},{"title":"Young America in 2020: In Our Own Words","slug":"young-america-in-2020-in-our-own-words"},{"title":"Hey GOP! Younger Gen Wants In","slug":"hey-gop-younger-gen-wants-in"},{"title":"Beyond Boeing: My Town, My Peers, Our Future","slug":"beyond-boeing-my-town-my-peers-our-future"},{"title":"Getting on Board with Kamala: It's Complicated","slug":"getting-on-board-with-kamala-its-complicated"},{"title":"From Quarantine to Class at NYU, a Freshman Starts Her Next Chapter","slug":"from-quarantine-to-class-at-nyu-a-freshman-starts-her-next-chapter"},{"title":"Barely Making It: Navigating 2020 as a Broke College Student","slug":"barely-making-it-navigating-2020-as-a-broke-college-student"},{"title":"Life in Legal Limbo: A Dreamer Reflects","slug":"life-in-legal-limbo-a-dreamer-reflects"},{"title":"Young and Sober During COVID-19","slug":"young-and-sober-during-covid-19"},{"title":"A Minnesotan Weighs In: Is There Hope After the Hashtags?","slug":"a-minnesotan-weighs-in-is-there-hope-after-the-hashtags"},{"title":"“I Am in Juárez. You Are in El Paso.” Pandemic Reflections From Borderland","slug":"i-am-in-juarez-you-are-in-el-paso-pandemic-reflections-from-borderland"},{"title":"Expecting the Unexpected: Graduating High School During a Pandemic","slug":"expecting-the-unexpected-graduating-high-school-during-a-pandemic"},{"title":"I’m Conservative and COVID-19 Brings Conflicts of Political Interest","slug":"im-conservative-and-covid-19-brings-conflicts-of-political-interest"}],"quotes":[{"quote":"“We are individual voices that form a collective voice for our younger generation at this moment.”","author":"Juan Mireles Palomar","location":"San Francisco, CA","authorslug":"juan-mireles-palomar"},{"quote":"“Because of the Black Lives Matter movement, I feel the most optimistic I've ever been about the future of the country.\"","author":"Sage Townsend","location":"Louisville, KY","authorslug":"sage-townsend"},{"quote":"“It’s time to show that young people are paying attention, getting active, and making an impact that will last generations.”","author":"Kaleigh Cunningham","location":"Missoula, MT","authorslug":"kaleigh-cunningham"},{"quote":"\"From the pandemic to the fight for equality, we have to monitor the factors that are contributing to a lot of the issues youth face today.\"","author":"Sher Delva","location":"Boynton Beach, FL","authorslug":"sher-delva"},{"quote":"“We are carving our own path forward because the old rules of American success have stopped applying.”","author":"Surya Hendry","location":"Everett, WA","authorslug":"surya-hendry"},{"quote":"“The youth right now are coming of age into a system in a standstill and now they want change. But will they show up to vote?\"","author":"Antonio Villaseñor-Baca","location":"El Paso, TX","authorslug":"antonio-villasenor-baca"},{"quote":"\"Political parties say they want to be inclusive, but are often gilded cages, making it hard to find our place in them, leaving us out of the conversation.”","author":"Laura Bratton","location":"Wilmington, NC","authorslug":"laura-bratton"},{"quote":"“I’m not looking to change anyone's mind, but if our voices can help people empathize just a little bit more with other communities, and get them to think more about where we are as a country, that's good.”","author":"Madison Hall","location":"Baltimore, MD","authorslug":"madison-hall"},{"quote":"“We all have our unique experiences, but the intersectionality of the issues we're tackling will be our greatest strength.”","author":"Virginia Gaffney","location":"Austin, TX","authorslug":"virginia-gaffney"}],"about":{"text":"<p>We are 18- to 29-year-olds. And we have the most at stake in the 2020 election. There is a lot of speculation in mainstream media about which candidate we will vote for and how many of us will actually go to the polls, but very little attention paid to our actual experiences and perspectives when it comes to the issues being debated on the national stage. These issues are more than talking points for us. They are the struggles that define our communities and our futures. They are our stories, they need to be told and we want to be the ones to tell them. Follow us as our perspectives are featured here and on partner outlets over the months leading up to the general election.</p>\n<p><a class=\"link blue underline underline-hover hover-dark-red\" href=\"https://yr.media/\" rel=\"nofollow\" target=\"_blank\">YR Media</a> and <a class=\"link blue underline underline-hover hover-dark-red\" href=\"https://www.wnyc.org/shows/rookies\" rel=\"nofollow\" target=\"_blank\">WNYC’s Radio Rookies</a> carried out a national contributor search. From more than one hundred applications to our open call for contributors, we selected a team of 13 talented young media makers. Contributors are racially and ethnically diverse, identify across the political spectrum, and represent every region in the country. With support from YR Media and Radio Rookies editorial staff, they are producing content in audio, video, and print formats on issues including race and criminal justice, #BlackLivesMatter, health care access, poverty, education, LGBTQ rights, college affordability, homelessness, opioid addiction and immigration. Check out an <a class=\"link blue underline underline-hover hover-dark-red\" href=\"https://pndblog.typepad.com/pndblog/2020/08/report-or-vote-young-bipoc-journalists-can-and-should-do-both.html\" rel=\"nofollow\" target=\"_blank\">OpEd from YR Media's CEO</a> on where this project fits in history. Also, don’t miss our collaboration with <a class=\"link blue underline underline-hover hover-dark-red\" href=\"http://bit.ly/psxyrmedia\" rel=\"nofollow\" target=\"_blank\">POPSUGAR</a>.</p>","credits":"The 18-to-29 Now: Young America Speaks Up project is made possible in part by the following supporters of YR Media and WNYC: John D. and Catherine T. MacArthur Foundation, the Ford Foundation, the Annie E. Casey Foundation, Margaret Neubart Foundation and Newman’s Own Foundation."},"header":{"copy":"From now through November 3rd, young adults from around the country document what’s at stake for them in the 2020 election."},"footer":{"text":"<p><b class=\"serif\">18-to-29 Now: Young America Speaks Up</b><br>\nYoung adults from around the country document what’s at stake for them in the 2020 election.</p>\n<p>Produced by YR Media and WNYC.</p>","newsletter":{"text":"<p>By submitting your information, you’re agreeing to receive communications from YR Media in accordance with our <a class=\"link blue underline underline-hover hover-dark-red\" href=\"https://yr.media/privacy-policy\" rel=\"nofollow\" target=\"_blank\">Privacy Policy</a> and from New York Public Radio in accordance with their <a class=\"link blue underline underline-hover hover-dark-red\" href=\"https://www.wnyc.org/terms\" rel=\"nofollow\" target=\"_blank\">Terms of Use</a>.</p>"}},"credits":{"title":"Credits","people":[{"title":"Reporters","names":"Sydney Livingston, Ariel Tang, Zoe Harwood","slug":"reporters"},{"title":"Editors/Producers","names":"Nimah Gobir, Marjerrie Masicat, Lissa Soep","slug":"editors-producers"},{"title":"Designer","names":"Marjerrie Masicat","slug":"designer"},{"title":"Developers","names":"Radamés Ajna, Devin Glover","slug":"developers"},{"title":"Audio Editors","names":"Galnadjee Joe-Johnson, Jacob Armenta","slug":"audio-editors"},{"title":"Researcher","names":"Rainier Harris","slug":"researcher"},{"title":"Project Lead","names":"Nimah Gobir","slug":"project-lead"}],"slug":"credits"}},"bios":[{"name":"Kelvey Vander Hart","image":"profiles/11_Kelvey-Vander-Hart.jpg","location":"Des Moines, IA","text":"<p>Kelvey Vander Hart calls herself a “conservatarian,” meaning she’s both conservative and libertarian. As an urbanite in Iowa, a state known for being rural, Kelvey believes conservation and environmentalism can unite people on both sides of the aisle. Kelvey is a Christ-follower, coffee addict and proud rescue mom to her mini dachshund, Watson. For 18-to-29 Now, she writes about her political values and the questions COVID-19 has raised for her.</p>","authorslug":"kelvey-vander-hart"},{"name":"Sher Delva","image":"profiles/4_Sher-Delva.jpg","location":"Boynton Beach, FL","text":"<p>Sher Delva first got politically active in 2016, when she became a supporter of Bernie Sanders. Sher is a member of the Democratic Socialists of America (DSA) and she’s reporting for 18-to-29 Now on where the movement should throw its weight, now that Bernie is out. As a part of South Florida’s creative community, she frequents open mics and performs spoken word poetry. She can often be found at her favorite coffee shop with her laptop propped open alongside a caramel macchiato.</p>","authorslug":"sher-delva"},{"name":"Madison Hall","image":"profiles/6_Madison-Hall.jpg","location":"Baltimore, MD","text":"<p>As a Baltimore native, Madison Hall has had a diverse range of experiences with education equality and classism — she’s now reporting on how distance learning during COVID-19 has only made the situation worse. Madison is a writer and a filmmaker with a strong interest in politics, she also enjoys mock trial competitions and cooking. Madison plans to attend NYU in the fall.</p>","authorslug":"madison-hall"},{"name":"Laura Bratton","image":"profiles/2_Laura-Bratton.jpg","location":"Wilmington, NC","text":"<p>Laura Bratton is an independent podcast producer in North Carolina who loves to surf. She started working in audio in 2019 with Working Narratives, a local arts and social justice nonprofit. There, she’s covered climate change and helped launch their local civic journalism lab called Shoresides. Laura starts each morning with her cat, Louie, and a large cup of coffee. She is an active member of the recovery community in her hometown of Wilmington — a topic she’s exploring for 18-to-29 Now.</p>","authorslug":"laura-bratton"},{"name":"Sage Townsend","image":"profiles/11_Sage-Townsend.jpg","location":"Louisville, KY","text":"<p>Sage Townsend is a transgender teenager with big hair and an even bigger personality. Originally from Lumberton, North Carolina, he is a country boy who has now found a home in the city of Louisville, Kentucky. Sage has a passion for art, music and writing. In 2018, he partnered with the Louisville Story Program and he’s been in love with storytelling ever since. An estimated 40% of homeless youth are LGTBQ — Sage was once one of them and he still struggles with housing insecurity, a topic he’s reporting on for 18-to-29 Now.</p>","authorslug":"sage-townsend"},{"name":"William Carter","image":"profiles/3_WillCarter.jpg","location":"Savannah, GA","text":"<p>William Carter has called Georgia home his entire life. In 2016, he became the youngest delegate elected in Georgia history and voted for Donald Trump at the Republican National Convention. Will graduated from Benedictine Military School with the rank of lieutenant colonel and plans to earn his juris doctorate at Mercer University. For 18-to-29 Now, he explores the future of the Republican party and what it means to be a young Republican as party insiders resist youth involvement.</p>","authorslug":"william-carter"},{"name":"Virginia Gaffney","image":"profiles/6_Virginia-Gaffney.jpg","location":"Austin, TX","text":"<p>Virginia Gaffney is an Irish Puerto Rican living in Austin, Texas. As a disabled queer woman, her identity, family and environment impact her world views and drive her to do the most she can, wherever she can. She loves her dogs and fried rice and took it personally when Zuccarello was traded to Minnesota. For 18-to-29 Now, Gaffney reports on her relationship with her grandmother and how they find ways to connect despite being on opposite sides of the political spectrum.</p>","authorslug":"virginia-gaffney"},{"name":"Antonio Villaseñor-Baca","image":"profiles/12_AntonioBaca.png","location":"El Paso, TX","text":"<p>Antonio Villaseñor-Baca is a Xicanx bilingual journalist, photographer, poet and writer from El Paso, Texas. Antonio spends his time listening to music and working toward his MFA in creative writing at the University of Texas at El Paso. He also teaches, runs his own music magazine, serves as online editor for Minero Magazine and writes for YR Media, El Paso Inc. and Borderzine. For 18-to-29 Now, Antonio reports on border identity and how misconceptions and stereotypical narratives affect borderlanders along the United States-Mexico border.</p>","authorslug":"antonio-villasenor-baca"},{"name":"Juan Mireles-Palomar","image":"profiles/9_Juan-Mireles-Palomar.jpg","location":"Stockton and San Francisco, CA","text":"<p>Juan Mireles-Palomar is a queer, undocumented immigrant who lived in Stockton, California before recently moving to San Francisco. In 2017, Juan started writing for YR Media with a focus on immigrants' rights issues. Through his work, he hopes to continue to seek justice and equal rights for those who are most disenfranchised. For18-to-29 Now, Juan explores the temporary and politicized nature of his immigration status and chronicles his family’s experience dealing with the ripple effects of deportation.</p>","authorslug":"juan-mireles-palomar"},{"name":"Erianna Jiles","image":"profiles/8_Erianna-Jiles.jpg","location":"St. Paul, MN","text":"<p>Erianna Jiles studies creative writing at Metropolitan State University in St. Paul, Minnesota. Previously, she studied journalism at North Dakota State University, where she documented her experience as a Black student on a mostly white campus. Erianna has produced stories for KFAI, where her work won an SPJ Page One Award, and has worked on multiple American Public Media podcasts. For 18-to-29 Now, Erianna reports on college affordability and how students are making ends meet.</p>","authorslug":"erianna-jiles"},{"name":"Surya Hendry","image":"profiles/7_Surya-Hendry.jpg","location":"Everett, WA","text":"<p>Surya Hendry grew up in Everett, Washington with three cats, seven chickens, one lizard and a younger sister. In Everett, she learned all about airplane construction, rainy weather and union politics. Surya was introduced to audio storytelling in 2016 as an intern with KUOW’s RadioActive Youth Media.For 18-to-29 Now, she reports on what the future looks like for her peers in a “company town” where middle class life doesn’t require an education, but depends on a good economy and a thriving industry. So what now?</p>","authorslug":"surya-hendry"},{"name":"Kharon Benson","image":"profiles/1_Kharon-Benson.jpg","location":"New York, NY","text":"<p>Kharon Benson is a filmmaker from Brooklyn, New York. As part of the Osborne Association’s Youth Advisory Board, Kharon successfully lobbied state legislators to change laws affecting children with incarcerated parents. In 2019, his film about his relationship with his father, who is serving a 25-year sentence, was screened at the The Rhode Island Film Festival. For 18-to-29 Now, Kharon reports on recent changes to the criminal justice system and how reforms are playing out in people’s lives.</p>","authorslug":"kharon-benson"},{"name":"Kaleigh Cunningham","image":"profiles/4_KaleighCunningham-duo.jpg","location":"Missoula, MT","text":"<p>Kaleigh Cunningham grew up in Pennsylvania and graduated from Kuztown University, where she founded a Young Americans for Liberty chapter. Kaleigh now lives in Montana, where she can be found getting outdoors as much as possible with her dog Slevin and empowering young people to act on the environment as deputy national field director at the American Conservation Coalition Campus. Kaleigh is an independent who typically votes third party — a choice she’s reporting on for 18-to-29 Now.</p>","authorslug":"kaleigh-cunningham"},{"name":"18-to-29 Now Team","image":"profiles/4_KaleighCunningham-duo.jpg","hide":"true","location":"Multiples","text":"<p>18-to-29 Now Team</p>","authorslug":"18-to-29-now-team"}]}